{"id": 0, "task": "Check if in a given list of numbers, any two numbers are closer to each other than a given threshold.\n\nInput format:\n- First line: A space-separated list of floating-point numbers\n- Second line: A floating-point threshold value\n\nOutput format:\n- A single line containing \"true\" if there exist any two numbers in the list whose absolute difference is less than the threshold, or \"false\" otherwise", "io_examples": [["1.0 2.0 3.9 4.0 5.0 2.2\n0.3", "true"], ["1.0 2.0 3.9 4.0 5.0 2.2\n0.05", "false"], ["1.0 2.0 5.9 4.0 5.0\n0.95", "true"], ["1.0 2.0 5.9 4.0 5.0\n0.8", "false"], ["1.0 2.0 3.0 4.0 5.0 2.0\n0.1", "true"], ["1.1 2.2 3.1 4.1 5.1\n1.0", "true"], ["1.1 2.2 3.1 4.1 5.1\n0.5", "false"]]}
{"id": 1, "task": "Input to this function is a string containing multiple groups of nested parentheses. Your goal is to separate those groups into separate strings and return them.\n\nSeparate groups are balanced (each open brace is properly closed) and not nested within each other. Ignore any spaces in the input string.\n\nInput format: A single line containing a string with parentheses and possibly spaces.\n\nOutput format: Each separated group of parentheses on a new line, in the order they appear in the input, with spaces removed.", "io_examples": [["(()()) ((())) () ((())()())", "(()())\n((()))\n()\n((())()())"], ["() (()) ((())) (((())))", "()\n(())\n((()))\n(((())))"], ["(()(())((())))", "(()(())((())))"], ["( ) (( )) (( )( ))", "()\n(())\n(()())"]]}
{"id": 2, "task": "You are given a sequence of deposit and withdrawal operations on a bank account that starts with zero balance. Your task is to detect if at any point the balance of the account falls below zero.\n\nInput: A sequence of integers representing operations (positive for deposits, negative for withdrawals). The input will be space-separated integers on a single line. An empty line represents an empty sequence.\n\nOutput: Return \"true\" if the balance falls below zero at any point during the operations, otherwise return \"false\".", "io_examples": [["", "false"], ["1 2 -3 1 2 -3", "false"], ["1 2 -4 5 6", "true"], ["1 -1 2 -2 5 -5 4 -4", "false"], ["1 -1 2 -2 5 -5 4 -5", "true"], ["1 -2 2 -2 5 -5 4 -4", "true"]]}
{"id": 3, "task": "For a given list of input numbers, calculate the Mean Absolute Deviation around the mean of the dataset.\n\nMean Absolute Deviation is the average absolute difference between each element and a centerpoint (mean in this case):\nMAD = average | x - x_mean |\n\nInput format: A single line containing space-separated floating-point numbers.\n\nOutput format: A single floating-point number representing the Mean Absolute Deviation.", "io_examples": [["1.0 2.0 3.0", "0.6666666666666666"], ["1.0 2.0 3.0 4.0", "1.0"], ["1.0 2.0 3.0 4.0 5.0", "1.2"]]}
{"id": 4, "task": "Insert a delimiter number between every two consecutive elements of an input list of integers.\n\nInput format:\n- First line: space-separated integers representing the list (or the word \"empty\" for an empty list)\n- Second line: a single integer representing the delimiter\n\nOutput format:\n- If the result is an empty list, output the word \"empty\"\n- Otherwise, output each integer in the resulting list on a separate line\n\nThe resulting list should have the delimiter inserted between each pair of consecutive elements from the original list.", "io_examples": [["empty\n7", "empty"], ["5 6 3 2\n8", "5\n8\n6\n8\n3\n8\n2"], ["2 2 2\n2", "2\n2\n2\n2\n2"]]}
{"id": 5, "task": "Input to this function is a string representing multiple groups of nested parentheses separated by spaces. For each group, output the deepest level of nesting of parentheses. For example, (()()) has maximum two levels of nesting while ((())) has three.\n\nInput format: A single line containing space-separated groups of parentheses.\nOutput format: Each group's maximum nesting depth, one per line.", "io_examples": [["(()()) ((())) () ((())()())", "2\n3\n1\n3"], ["() (()) ((())) (((())))", "1\n2\n3\n4"], ["(()(())((())))", "4"]]}
{"id": 6, "task": "Filter an input list of strings to return only those that contain a given substring.\n\nInput format:\n- First line: A JSON array of strings\n- Second line: A substring to search for\n\nOutput format:\n- Each string from the input list that contains the substring, printed on a separate line\n- If no strings contain the substring, produce no output", "io_examples": [["[]\njohn", ""], ["[\"xxx\", \"asd\", \"xxy\", \"john doe\", \"xxxAAA\", \"xxx\"]\nxxx", "xxx\nxxxAAA\nxxx"], ["[\"xxx\", \"asd\", \"aaaxxy\", \"john doe\", \"xxxAAA\", \"xxx\"]\nxx", "xxx\naaaxxy\nxxxAAA\nxxx"], ["[\"grunt\", \"trumpet\", \"prune\", \"gruesome\"]\nrun", "grunt\nprune"]]}
{"id": 7, "task": "For a given sequence of integers, compute and return two values: the sum of all integers and the product of all integers in the sequence.\n\nInput format: A single line containing space-separated integers. An empty line represents an empty sequence.\n\nOutput format: Two lines - the first line contains the sum, and the second line contains the product.\n\nSpecial cases: For an empty sequence, the sum should be 0 and the product should be 1.", "io_examples": [["", "0\n1"], ["1 2 3 4", "10\n24"], ["1 1 1", "3\n1"], ["100 0", "100\n0"], ["3 5 7", "15\n105"], ["10", "10\n10"]]}
{"id": 8, "task": "Given a sequence of integers, generate a sequence of rolling maximum elements. For each position in the input sequence, the output at that position should be the maximum element found from the start of the sequence up to and including that position.\n\nInput format:\n- First line: An integer n (0 ≤ n ≤ 10^6) representing the count of numbers\n- Second line (if n > 0): n space-separated integers representing the sequence\n\nOutput format:\n- If n = 0, produce no output\n- Otherwise, output n lines, where each line contains one integer representing the rolling maximum at that position", "io_examples": [["0\n", ""], ["4\n1 2 3 4", "1\n2\n3\n4"], ["4\n4 3 2 1", "4\n4\n4\n4"], ["5\n3 2 3 100 3", "3\n3\n3\n100\n100"]]}
{"id": 9, "task": "Given two strings consisting only of the characters '1' and '0', perform a binary XOR operation on these inputs and return the result as a string.\n\nThe XOR operation works as follows: for each pair of corresponding characters in the two input strings, if the characters are the same, the result is '0'; if they are different, the result is '1'.\n\nInput format: Two lines, each containing a string of '0's and '1's. Both strings will have the same length.\n\nOutput format: A single line containing the XOR result as a string of '0's and '1's.", "io_examples": [["111000\n101010", "010010"], ["1\n1", "0"], ["0101\n0000", "0101"]]}
{"id": 10, "task": "Given a collection of strings, find and return the longest one. If multiple strings have the same maximum length, return the first one that appears in the collection. If the input collection is empty, return None.\n\nInput format: \n- First line: an integer n representing the number of strings (n >= 0)\n- Next n lines: each line contains one string\n\nOutput format:\n- If the collection is empty (n = 0), output \"None\"\n- Otherwise, output the longest string (the first one if there are multiple strings with the same maximum length)", "io_examples": [["0", "None"], ["3\nx\ny\nz", "x"], ["6\nx\nyyy\nzzzz\nwww\nkkkk\nabc", "zzzz"]]}
{"id": 11, "task": "Return the greatest common divisor of two integers a and b.\n\nInput format: Two space-separated integers a and b on a single line.\nOutput format: A single integer representing the greatest common divisor of a and b.", "io_examples": [["3 7", "1"], ["10 15", "5"], ["49 14", "7"], ["144 60", "12"]]}
{"id": 12, "task": "Return all prefixes from shortest to longest of the input string.\n\nInput: A single string (may be empty)\nOutput: Each prefix of the input string on a separate line, ordered from shortest to longest. If the input string is empty, produce no output.", "io_examples": [["", ""], ["asdfgh", "a\nas\nasd\nasdf\nasdfg\nasdfgh"], ["WWW", "W\nWW\nWWW"]]}
{"id": 13, "task": "Given a non-negative integer n, generate a sequence of numbers starting from 0 up to and including n. The numbers should be separated by single spaces in the output.\n\nInput format: A single non-negative integer n.\nOutput format: A string containing space-delimited numbers from 0 to n inclusive.", "io_examples": [["0", "0"], ["3", "0 1 2 3"], ["10", "0 1 2 3 4 5 6 7 8 9 10"]]}
{"id": 14, "task": "Given a string, count how many distinct characters it contains, where uppercase and lowercase versions of the same character are considered identical.\n\nInput: A single line containing a string (may be empty).\nOutput: A single integer representing the count of distinct characters (case-insensitive).", "io_examples": [["", "0"], ["abcde", "5"], ["abcdecadeCADE", "5"], ["aaaaAAAAaaaa", "1"], ["Jerry jERRY JeRRRY", "5"]]}
{"id": 15, "task": "Input to this function is a string representing musical notes in a special ASCII format.\nYour task is to parse this string and return a list of integers corresponding to how many beats each note lasts.\n\nHere is a legend:\n'o' - whole note, lasts four beats\n'o|' - half note, lasts two beats\n'.|' - quarter note, lasts one beat\n\nThe input is a string containing musical notes separated by spaces. The output should be the beat count for each note, with each count on a separate line. If the input is empty, the output should be empty.", "io_examples": [["", ""], ["o o o o", "4\n4\n4\n4"], [".| .| .| .|", "1\n1\n1\n1"], ["o| o| .| .| o o o o", "2\n2\n1\n1\n4\n4\n4\n4"], ["o| .| o| .| o o| o o|", "2\n1\n2\n1\n4\n2\n4\n2"]]}
{"id": 16, "task": "Input is a space-delimited string of number words from 'zero' to 'nine'. Valid choices are 'zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight' and 'nine'. Return the string with numbers sorted from smallest to largest, maintaining the space-delimited format. If the input is empty, return an empty string.", "io_examples": [["", ""], ["three", "three"], ["three five nine", "three five nine"], ["five zero four seven nine eight", "zero four five seven eight nine"], ["six five four three two one zero", "zero one two three four five six"]]}
{"id": 17, "task": "From a supplied list of numbers (of length at least two), select and return two that are the closest to each other and return them in order (smaller number, larger number).\n\nInput format: A single line containing space-separated decimal numbers.\nOutput format: Two lines, each containing one decimal number. The first line contains the smaller of the two closest numbers, and the second line contains the larger of the two closest numbers.", "io_examples": [["1.0 2.0 3.9 4.0 5.0 2.2", "3.9\n4.0"], ["1.0 2.0 5.9 4.0 5.0", "5.0\n5.9"], ["1.0 2.0 3.0 4.0 5.0 2.2", "2.0\n2.2"], ["1.0 2.0 3.0 4.0 5.0 2.0", "2.0\n2.0"], ["1.1 2.2 3.1 4.1 5.1", "2.2\n3.1"]]}
{"id": 18, "task": "Given a list of numbers (of at least two elements), apply a linear transformation to that list such that the smallest number will become 0 and the largest will become 1.\n\nInput format: A sequence of space-separated floating-point numbers.\nOutput format: The rescaled values, one per line, as floating-point numbers.", "io_examples": [["2.0 49.9", "0.0\n1.0"], ["100.0 49.9", "1.0\n0.0"], ["1.0 2.0 3.0 4.0 5.0", "0.0\n0.25\n0.5\n0.75\n1.0"], ["2.0 1.0 5.0 3.0 4.0", "0.25\n0.0\n1.0\n0.5\n0.75"], ["12.0 11.0 15.0 13.0 14.0", "0.25\n0.0\n1.0\n0.5\n0.75"]]}
{"id": 19, "task": "Filter a given list of mixed-type values to keep only integer values.\n\nInput: A JSON array containing values of various types (integers, floating-point numbers, strings, objects, arrays, etc.)\n\nOutput: Each integer from the input array, in the order they appear, printed on a separate line. If there are no integers, produce no output.\n\nNote: Only exact integer types should be included in the output. Floating-point numbers (even if they have integer values like 3.0) should not be included.", "io_examples": [["[]", ""], ["[4, {}, [], 23.2, 9, \"adasd\"]", "4\n9"], ["[3, \"c\", 3, 3, \"a\", \"b\"]", "3\n3\n3"]]}
{"id": 20, "task": "For a given positive integer n, find the largest number that divides n evenly (with no remainder) that is smaller than n itself.\n\nInput: A single positive integer n (n > 1)\nOutput: A single integer representing the largest divisor of n that is smaller than n", "io_examples": [["3", "1"], ["7", "1"], ["10", "5"], ["100", "50"], ["49", "7"], ["15", "5"]]}
{"id": 21, "task": "From a sequence of integers, remove all elements that occur more than once. Keep the order of elements left the same as in the input.\n\nInput format: A single line containing space-separated integers. An empty line represents an empty sequence.\n\nOutput format: Each integer that should remain in the sequence, printed on a separate line. If the result is empty, produce no output.", "io_examples": [["", ""], ["1 2 3 4", "1\n2\n3\n4"], ["1 2 3 2 4 3 5", "1\n4\n5"]]}
{"id": 22, "task": "For a given string, flip the case of all alphabetic characters. Lowercase characters should be converted to uppercase, and uppercase characters should be converted to lowercase. Non-alphabetic characters should remain unchanged.\n\nInput: A single line containing a string (may be empty).\nOutput: A single line containing the string with all character cases flipped.", "io_examples": [["", ""], ["Hello!", "hELLO!"], ["These violent delights have violent ends", "tHESE VIOLENT DELIGHTS HAVE VIOLENT ENDS"]]}
{"id": 23, "task": "Concatenate a list of strings into a single string.\n\nInput format:\n- First line: an integer n, the number of strings (n ≥ 0)\n- Next n lines: each line contains one string\n\nOutput format:\n- A single line containing all the input strings concatenated together in order, with no separator between them\n- If the input list is empty (n=0), output an empty line", "io_examples": [["0\n", ""], ["3\nx\ny\nz\n", "xyz"], ["5\nx\ny\nz\nw\nk\n", "xyzwk"]]}
{"id": 24, "task": "Filter a list of strings to keep only those that start with a given prefix.\n\nInput format:\n- First line: an integer n, the number of strings in the list\n- Next n lines: each contains one string from the list\n- Last line: a string representing the prefix to filter by\n\nOutput format:\n- Each string from the input list that starts with the given prefix, printed on a separate line\n- If no strings match or the list is empty, produce no output", "io_examples": [["0\njohn", ""], ["6\nxxx\nasd\nxxy\njohn doe\nxxxAAA\nxxx\nxxx", "xxx\nxxxAAA\nxxx"]]}
{"id": 25, "task": "Given a list of integers, filter and return only the positive numbers (numbers greater than 0).\n\nInput format: A list of integers in the format [n1, n2, n3, ...] where each ni is an integer. The list may be empty.\n\nOutput format: Each positive number from the input list, printed on a separate line, in the order they appear in the input. If there are no positive numbers, produce no output.", "io_examples": [["[-1, -2, 4, 5, 6]", "4\n5\n6"], ["[5, 3, -5, 2, 3, 3, 9, 0, 123, 1, -10]", "5\n3\n2\n3\n3\n9\n123\n1"], ["[-1, -2]", ""], ["[]", ""]]}
{"id": 26, "task": "Determine whether a given number is prime or not.\n\nA prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself.\n\nInput: A single integer n.\nOutput: \"True\" if the number is prime, \"False\" otherwise.", "io_examples": [["6", "False"], ["101", "True"], ["11", "True"], ["13441", "True"], ["61", "True"], ["4", "False"], ["1", "False"], ["5", "True"], ["17", "True"], ["85", "False"], ["77", "False"]]}
{"id": 27, "task": "Given coefficients of a polynomial, find a value x such that the polynomial evaluates to zero at x.\n\nThe polynomial is defined as: coefficients[0] + coefficients[1] * x + coefficients[2] * x^2 + ... + coefficients[n] * x^n\n\nInput format: A single line containing space-separated numbers representing the polynomial coefficients in order from the constant term (x^0) to the highest degree term.\n\nOutput format: A single floating-point number representing a root of the polynomial (a value x where the polynomial equals zero).\n\nConstraints:\n- The input will have an even number of coefficients\n- The largest coefficient is non-zero\n- These constraints guarantee that a solution exists\n\nThe solution should be accurate such that when the value is substituted back into the polynomial, the result is very close to zero (within 1e-4).", "io_examples": [["1 2", "-0.5000000000582077"], ["-6 11 -6 1", "0.9999999999417923"], ["-10 -2", "-5.000000000058208"], ["8 3", "-2.666666666686069"]]}
{"id": 28, "task": "Given a list of integers, return a new list where:\n- Elements at indices that are divisible by 3 (i.e., indices 0, 3, 6, 9, ...) are sorted in ascending order among themselves and placed back at those same positions\n- All other elements remain in their original positions unchanged\n\nInput format: A single line containing space-separated integers representing the list.\nOutput format: A single line containing space-separated integers representing the resulting list.", "io_examples": [["1 2 3", "1 2 3"], ["5 6 3 4 8 9 2", "2 6 3 4 8 9 5"], ["5 3 -5 2 -3 3 9 0 123 1 -10", "1 3 -5 2 -3 3 5 0 123 9 -10"], ["5 8 -12 4 23 2 3 11 12 -10", "-10 8 -12 3 23 2 4 11 12 5"], ["5 8 3 4 6 9 2", "2 8 3 4 6 9 5"], ["5 6 9 4 8 3 2", "2 6 9 4 8 3 5"], ["5 6 3 4 8 9 2 1", "2 6 3 4 8 9 5 1"]]}
{"id": 29, "task": "Given a list of integers, return the unique elements from the list in sorted ascending order. \n\nInput format: A list of integers in JSON array format (e.g., [5, 3, 5, 2, 3, 3, 9, 0, 123])\nOutput format: Each unique element printed on a separate line, in ascending sorted order.", "io_examples": [["[5, 3, 5, 2, 3, 3, 9, 0, 123]", "0\n2\n3\n5\n9\n123"]]}
{"id": 30, "task": "Given a list of integers, find and return the maximum element in the list.\n\nInput format: A single line containing space-separated integers.\nOutput format: A single integer representing the maximum value in the list.", "io_examples": [["1 2 3", "3"], ["5 3 -5 2 -3 3 9 0 124 1 -10", "124"]]}
{"id": 31, "task": "Given a positive integer n, count how many times the digit 7 appears in all integers less than n that are divisible by 11 or 13.\n\nMore specifically:\n1. Consider all integers i where 0 <= i < n\n2. Filter those integers that are divisible by 11 OR divisible by 13 (or both)\n3. For each such integer, count how many times the digit 7 appears in its decimal representation\n4. Return the total count of all occurrences of the digit 7\n\nInput format: A single integer n\nOutput format: A single integer representing the total count of digit 7 occurrences\n\nExamples:\n- For n=50: The integers less than 50 divisible by 11 or 13 are: 0, 11, 13, 22, 26, 33, 39, 44. None of these contain the digit 7, so the answer is 0.\n- For n=78: The integers include 77 (which contains two 7s), so the answer is 2.\n- For n=79: The integers include 77 (two 7s) and 78 (one 7), so the answer is 3.", "io_examples": [["50", "0"], ["78", "2"], ["79", "3"], ["100", "3"]]}
{"id": 32, "task": "Given a sequence of integers, return a new sequence where:\n- Elements at odd positions (1st, 3rd, 5th, ... using 0-based indexing: indices 1, 3, 5, ...) remain in their original positions\n- Elements at even positions (0th, 2nd, 4th, ... using 0-based indexing: indices 0, 2, 4, ...) are sorted in ascending order and placed back at even positions\n\nInput format: A sequence of space-separated integers\nOutput format: A sequence of space-separated integers representing the transformed sequence", "io_examples": [["1 2 3", "1 2 3"], ["5 3 -5 2 -3 3 9 0 123 1 -10", "-10 3 -5 2 -3 3 5 0 9 1 123"], ["5 8 -12 4 23 2 3 11 12 -10", "-12 8 3 4 5 2 12 11 23 -10"]]}
{"id": 33, "task": "Given a string that has been encoded using a cyclic encoding scheme, decode it back to the original string.\n\nThe encoding scheme works as follows:\n1. The string is split into consecutive groups of 3 characters (the last group may have fewer than 3 characters if the string length is not divisible by 3)\n2. For each group that has exactly 3 characters, the characters are cycled by moving the first character to the end (e.g., \"abc\" becomes \"bca\")\n3. Groups with fewer than 3 characters remain unchanged\n\nYour task is to decode a string that has been encoded using this scheme and return the original string.\n\nInput format: A single line containing the encoded string (consisting of lowercase letters)\nOutput format: A single line containing the decoded string", "io_examples": [["bca", "abc"], ["bcaefd", "abcdef"], ["elhowlrlod", "helloworld"], ["ab", "ab"]]}
{"id": 34, "task": "Find the n-th number that is both a Fibonacci number and a prime number.\n\nA Fibonacci number is part of a sequence where each number is the sum of the two preceding ones, starting from 0 and 1 (i.e., 0, 1, 1, 2, 3, 5, 8, 13, 21, ...).\n\nA prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself.\n\nInput: A single positive integer n.\nOutput: A single integer representing the n-th number that is both a Fibonacci number and prime.", "io_examples": [["1", "2"], ["2", "3"], ["3", "5"], ["4", "13"], ["5", "89"], ["6", "233"], ["7", "1597"], ["8", "28657"], ["9", "514229"], ["10", "433494437"]]}
{"id": 35, "task": "Given a list of integers, determine if there are three distinct elements in the list that sum to zero.\n\nInput format: A sequence of space-separated integers on a single line.\n\nOutput format: Output \"True\" if there exist three distinct elements at different positions in the list that sum to zero, otherwise output \"False\".\n\nNote: The three elements must be at distinct positions in the list (i.e., using indices i, j, k where i < j < k).", "io_examples": [["1 3 5 0", "False"], ["1 3 5 -1", "False"], ["1 3 -2 1", "True"], ["1 2 3 7", "False"], ["1 2 5 7", "False"], ["2 4 -5 3 9 7", "True"], ["1", "False"], ["1 3 5 -100", "False"], ["100 3 5 -100", "False"]]}
{"id": 36, "task": "Imagine a road that's a perfectly straight infinitely long line. n cars are driving left to right; simultaneously, a different set of n cars are driving right to left. The two sets of cars start out being very far from each other. All cars move at the same speed. Two cars are said to collide when a car that's moving left to right hits a car that's moving right to left. However, the cars are infinitely sturdy and strong; as a result, they continue moving in their trajectory as if they did not collide.\n\nCalculate the number of such collisions.\n\nInput: A single integer n representing the number of cars moving in each direction.\nOutput: A single integer representing the total number of collisions.", "io_examples": [["2", "4"], ["3", "9"], ["4", "16"], ["8", "64"], ["10", "100"]]}
{"id": 37, "task": "Given a sequence of integers, return a new sequence where each element is incremented by 1.\n\nInput format: A single line containing space-separated integers. An empty line represents an empty sequence.\n\nOutput format: Each incremented integer on a separate line. For an empty input, produce no output.", "io_examples": [["", ""], ["3 2 1", "4\n3\n2"], ["5 2 5 2 3 3 9 0 123", "6\n3\n6\n3\n4\n4\n10\n1\n124"]]}
{"id": 38, "task": "Given a list of integers as input, determine if there are two distinct elements in the list that sum to zero.\n\nInput format: A sequence of space-separated integers.\n\nOutput format: Output \"True\" if there are two distinct elements that sum to zero, and \"False\" otherwise.", "io_examples": [["1 3 5 0", "False"], ["1 3 -2 1", "False"], ["1 2 3 7", "False"], ["2 4 -5 3 5 7", "True"], ["1", "False"], ["-3 9 -1 3 2 30", "True"], ["-3 9 -1 3 2 31", "True"], ["-3 9 -1 4 2 30", "False"], ["-3 9 -1 4 2 31", "False"]]}
{"id": 39, "task": "Convert a number from base 10 to a different numerical base and return the string representation after conversion. The target base will be less than 10.\n\nInput format: Two integers separated by a space - the first integer is the number to convert (x), and the second integer is the target base.\n\nOutput format: A string representing the number x in the specified base.", "io_examples": [["8 3", "22"], ["9 3", "100"], ["234 2", "11101010"], ["16 2", "10000"], ["8 2", "1000"], ["7 2", "111"], ["2 3", "2"], ["3 4", "3"], ["4 5", "4"], ["5 6", "5"], ["6 7", "6"], ["7 8", "7"]]}
{"id": 40, "task": "Given the length of a base and the corresponding height of a triangle, calculate and return the area of the triangle.\n\nInput format: Two space-separated numbers on a single line, where the first number is the length of the base (a) and the second number is the height (h).\n\nOutput format: A single number representing the area of the triangle. The result may be a decimal number.", "io_examples": [["5 3", "7.5"], ["2 2", "2.0"], ["10 8", "40.0"]]}
{"id": 41, "task": "The Fib4 number sequence is a sequence similar to the Fibonacci sequence that's defined as follows:\n- fib4(0) = 0\n- fib4(1) = 0\n- fib4(2) = 2\n- fib4(3) = 0\n- fib4(n) = fib4(n-1) + fib4(n-2) + fib4(n-3) + fib4(n-4) for n >= 4\n\nWrite a program to efficiently compute the n-th element of the fib4 number sequence without using recursion.\n\nInput format: A single integer n (n >= 0) representing the index in the Fib4 sequence.\n\nOutput format: A single integer representing the n-th element of the Fib4 sequence.", "io_examples": [["5", "4"], ["8", "28"], ["10", "104"], ["12", "386"]]}
{"id": 42, "task": "Return the median of elements in a list of numbers.\n\nThe median is defined as:\n- If the list has an odd number of elements, the median is the middle element when the list is sorted.\n- If the list has an even number of elements, the median is the average of the two middle elements when the list is sorted.\n\nInput format: A single line containing space-separated integers.\nOutput format: A single number representing the median. This may be an integer or a decimal number.", "io_examples": [["3 1 2 4 5", "3"], ["-10 4 6 1000 10 20", "8.0"], ["5", "5"], ["6 5", "5.5"], ["8 1 3 9 9 2 7", "7"]]}
{"id": 43, "task": "Check if a given string is a palindrome. A palindrome is a string that reads the same forwards and backwards.\n\nInput: A single line containing a string (which may be empty).\n\nOutput: A single line containing \"true\" if the string is a palindrome, or \"false\" if it is not.", "io_examples": [["", "true"], ["aba", "true"], ["aaaaa", "true"], ["zbcd", "false"], ["xywyx", "true"], ["xywyz", "false"], ["xywzx", "false"]]}
{"id": 44, "task": "Given two integers n and p, compute 2 raised to the power n, modulo p.\n\nInput format: Two space-separated integers n and p on a single line, where n is the exponent and p is the modulus.\n\nOutput format: A single integer representing the result of 2^n modulo p.", "io_examples": [["3 5", "3"], ["1101 101", "2"], ["0 101", "1"], ["3 11", "8"], ["100 101", "1"], ["30 5", "4"], ["31 5", "3"]]}
{"id": 45, "task": "Given a string that has been encoded by shifting every lowercase letter by 5 positions forward in the alphabet (with wrapping, so 'v' becomes 'a', 'w' becomes 'b', etc.), decode the string by reversing this shift operation.\n\nThe input will be a single line containing an encoded string consisting only of lowercase letters from 'a' to 'z'.\n\nThe output should be a single line containing the decoded string, where each character has been shifted back by 5 positions in the alphabet (with wrapping).", "io_examples": [["mjqqt", "hello"], ["btwqi", "world"], ["fgh", "abc"], ["cde", "xyz"], ["uwtlwfrrnsl", "programming"]]}
{"id": 46, "task": "Write a program that removes all vowels from a given string. A vowel is defined as any of the following characters: 'a', 'e', 'i', 'o', 'u' (both uppercase and lowercase versions should be removed).\n\nInput: A single string that may contain letters (uppercase and lowercase), digits, special characters, and newlines.\n\nOutput: The input string with all vowels removed. All other characters (including whitespace, newlines, and non-vowel letters) should be preserved in their original positions.", "io_examples": [["", ""], ["abcdef\nghijklm", "bcdf\nghjklm"], ["fedcba", "fdcb"], ["eeeee", ""], ["acBAA", "cB"], ["EcBOO", "cB"], ["ybcd", "ybcd"]]}
{"id": 47, "task": "Given a list of integers and a threshold value, determine if all numbers in the list are below the threshold. A number is considered below the threshold if it is strictly less than the threshold value.\n\nInput format:\n- First line: space-separated integers representing the list\n- Second line: a single integer representing the threshold\n\nOutput format:\n- A single line containing \"true\" if all numbers in the list are below the threshold, \"false\" otherwise", "io_examples": [["1 2 4 10\n100", "true"], ["1 20 4 10\n5", "false"], ["1 20 4 10\n21", "true"], ["1 20 4 10\n22", "true"], ["1 8 4 10\n11", "true"], ["1 8 4 10\n10", "false"]]}
{"id": 48, "task": "Add two numbers x and y.\n\nInput: Two integers x and y, provided as space-separated values on a single line.\nOutput: A single integer representing the sum of x and y.", "io_examples": [["0 1", "1"], ["2 3", "5"], ["5 7", "12"], ["7 5", "12"]]}
{"id": 49, "task": "Check if two strings have the same set of unique characters.\n\nTwo strings are considered to have the same characters if they contain exactly the same set of unique characters, regardless of how many times each character appears or the order in which they appear.\n\nInput: Two strings, each on a separate line.\nOutput: \"True\" if the two strings have the same set of unique characters, \"False\" otherwise.", "io_examples": [["eabcdzzzz\ndddzzzzzzzddeddabc", "True"], ["abcd\ndddddddabc", "True"], ["dddddddabc\nabcd", "True"], ["eabcd\ndddddddabc", "False"], ["abcd\ndddddddabcf", "False"], ["eabcdzzzz\ndddzzzzzzzddddabc", "False"], ["aabb\naaccc", "False"]]}
{"id": 50, "task": "Return the n-th Fibonacci number.\n\nThe Fibonacci sequence is defined as follows:\n- The 0th Fibonacci number is 0\n- The 1st Fibonacci number is 1\n- For n > 1, the n-th Fibonacci number is the sum of the (n-1)-th and (n-2)-th Fibonacci numbers\n\nInput: A single integer n (n >= 0)\nOutput: A single integer representing the n-th Fibonacci number", "io_examples": [["10", "55"], ["1", "1"], ["8", "21"], ["11", "89"], ["12", "144"]]}
{"id": 51, "task": "Given a string containing only the characters \"<\" and \">\", determine if every opening bracket \"<\" has a corresponding closing bracket \">\" that appears after it, and the brackets are properly nested.\n\nA string is considered properly bracketed if:\n1. Every opening bracket \"<\" can be matched with a closing bracket \">\" that comes after it\n2. At no point while reading from left to right should the number of closing brackets exceed the number of opening brackets\n3. The total number of opening brackets equals the total number of closing brackets\n\nInput format: A single line containing a string of \"<\" and \">\" characters.\n\nOutput format: A single line containing \"true\" if the brackets are properly balanced, or \"false\" otherwise.", "io_examples": [["<>", "true"], ["<<><>>", "true"], ["<><><<><>><>", "true"], ["<><><<<><><>><>><<><><<>>>", "true"], ["><<>", "false"], ["<", "false"], [">", "false"], ["<<<><>>>>", "false"], ["<<<<", "false"], ["<<>", "false"], ["<><><<><>><>><<>", "false"], ["<><><<><>><>>><>", "false"]]}
{"id": 52, "task": "Given a sequence of integers, determine whether the sequence is monotonic. A sequence is monotonic if it is either monotonically increasing (each element is greater than or equal to the previous one) or monotonically decreasing (each element is less than or equal to the previous one).\n\nInput: A sequence of space-separated integers.\nOutput: \"True\" if the sequence is monotonic (either non-decreasing or non-increasing), \"False\" otherwise.", "io_examples": [["1 2 4 10", "True"], ["1 2 4 20", "True"], ["1 20 4 10", "False"], ["4 1 0 -10", "True"], ["4 1 1 0", "True"], ["1 2 3 2 5 60", "False"], ["1 2 3 4 5 60", "True"], ["9 9 9 9", "True"]]}
{"id": 53, "task": "Given two sequences of integers, find all elements that appear in both sequences. Return these common elements in sorted order, with each element appearing only once (no duplicates).\n\nInput format: Two lines, each containing space-separated integers. The second line may be empty to represent an empty sequence.\n\nOutput format: Each common element on a new line, in ascending sorted order. If there are no common elements, produce no output.", "io_examples": [["1 4 3 34 653 2 5\n5 7 1 5 9 653 121", "1\n5\n653"], ["5 3 2 8\n3 2", "2\n3"], ["4 3 2 8\n3 2 4", "2\n3\n4"], ["4 3 2 8\n", ""]]}
{"id": 54, "task": "Given an integer n (where n > 1 and n is not a prime number), find and return the largest prime factor of n.\n\nA prime factor is a factor of n that is also a prime number. A prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself.\n\nInput format: A single integer n\nOutput format: A single integer representing the largest prime factor of n", "io_examples": [["15", "5"], ["27", "3"], ["63", "7"], ["330", "11"], ["13195", "29"]]}
{"id": 55, "task": "Write a function that computes the sum of all integers from 1 to n (inclusive).\n\nInput: A single integer n (n >= 1)\nOutput: A single integer representing the sum of all integers from 1 to n\n\nFor example:\n- If n is 30, the sum is 1 + 2 + 3 + ... + 30 = 465\n- If n is 100, the sum is 1 + 2 + 3 + ... + 100 = 5050\n- If n is 5, the sum is 1 + 2 + 3 + 4 + 5 = 15\n- If n is 1, the sum is 1", "io_examples": [["1", "1"], ["6", "21"], ["11", "66"], ["30", "465"], ["100", "5050"]]}
{"id": 56, "task": "Given a string containing only the characters \"(\" and \")\", determine if every opening bracket has a corresponding closing bracket in the correct order.\n\nA string is correctly bracketed if:\n1. Every opening bracket \"(\" has a matching closing bracket \")\"\n2. At no point while reading left to right should the number of closing brackets exceed the number of opening brackets\n3. The total number of opening and closing brackets must be equal\n\nInput: A single line containing a string of \"(\" and \")\" characters.\n\nOutput: A single line containing \"True\" if the brackets are correctly balanced, or \"False\" otherwise.", "io_examples": [["()", "True"], ["(()())", "True"], ["()()(()())()", "True"], ["()()((()()())())(()()(()))", "True"], ["((()())))", "False"], [")(())", "False"], ["(", "False"], ["((((", "False"], [")", "False"], ["(()", "False"], ["()()(()())())(())", "False"], ["()()(()())()))()", "False"]]}
{"id": 57, "task": "Given a list of coefficients representing a polynomial, compute the derivative of the polynomial and return it in the same form.\n\nThe polynomial is represented as: xs[0] + xs[1] * x + xs[2] * x^2 + xs[3] * x^3 + ...\n\nThe derivative of this polynomial follows the power rule: the derivative of x^n is n * x^(n-1).\n\nInput format: A single line containing space-separated integers representing the coefficients of the polynomial, starting from the constant term (x^0).\n\nOutput format: Each coefficient of the derivative polynomial on a separate line, starting from the constant term of the derivative (which was the x^1 term in the original). If the derivative is empty (i.e., the input was a constant), produce no output.", "io_examples": [["3 1 2 4 5", "1\n4\n12\n20"], ["1 2 3", "2\n6"], ["3 2 1", "2\n2"], ["3 2 1 0 4", "2\n2\n0\n16"], ["1", ""]]}
{"id": 58, "task": "The FibFib number sequence is a sequence similar to the Fibonacci sequence that's defined as follows:\n- The value at position 0 is 0\n- The value at position 1 is 0\n- The value at position 2 is 1\n- For any position n greater than 2, the value is the sum of the values at positions n-1, n-2, and n-3\n\nWrite a program to efficiently compute the n-th element of the FibFib number sequence.\n\nInput: A single non-negative integer n\nOutput: A single integer representing the n-th element of the FibFib sequence", "io_examples": [["2", "1"], ["1", "0"], ["5", "4"], ["8", "24"], ["10", "81"], ["12", "274"], ["14", "927"]]}
{"id": 59, "task": "Write a program that counts the number of vowels in a given word (string).\n\nThe vowels are defined as follows:\n- The letters 'a', 'e', 'i', 'o', 'u' are always vowels (case-insensitive, so 'A', 'E', 'I', 'O', 'U' are also vowels)\n- The letter 'y' (or 'Y') is also considered a vowel, but ONLY when it appears at the end of the word\n\nInput format: A single line containing a string representing a word.\n\nOutput format: A single integer representing the total count of vowels in the word.", "io_examples": [["abcde", "2"], ["Alone", "3"], ["key", "2"], ["bye", "1"], ["keY", "2"], ["bYe", "1"], ["ACEDY", "3"]]}
{"id": 60, "task": "Perform a circular shift operation on the digits of an integer.\n\nGiven an integer x and a shift amount, perform a circular shift of the digits to the right by the specified shift amount. If the shift amount is greater than the number of digits in the integer, reverse the digits instead.\n\nInput format: Two space-separated integers on a single line:\n- The first integer is the number whose digits will be shifted\n- The second integer is the shift amount\n\nOutput format: A string representing the shifted digits\n\nExamples:\n- If the input is 12 and shift is 1, the rightmost 1 digit moves to the front, resulting in \"21\"\n- If the input is 12 and shift is 2, all digits shift completely around, resulting in \"12\"\n- If the input is 100 and shift is 2, the rightmost 2 digits move to the front, resulting in \"001\"\n- If the input is 97 and shift is 8 (which is greater than 2 digits), the digits are reversed, resulting in \"79\"", "io_examples": [["100 2", "001"], ["12 2", "12"], ["97 8", "79"], ["12 1", "21"], ["11 101", "11"]]}
{"id": 61, "task": "Given a string that describes the number of apples and oranges in a basket, and an integer representing the total number of fruits in the basket (which contains apples, oranges, and mangos), calculate and return the number of mango fruits in the basket.\n\nInput format:\n- First line: A string containing the counts of apples and oranges (e.g., \"5 apples and 6 oranges\")\n- Second line: An integer representing the total number of fruits in the basket\n\nOutput format:\n- A single integer representing the number of mango fruits\n\nThe number of mangos is calculated by subtracting the number of apples and oranges from the total number of fruits.\n\nExamples:\n- Input: \"5 apples and 6 oranges\" and 19 → Output: 8 (because 19 - 5 - 6 = 8)\n- Input: \"0 apples and 1 oranges\" and 3 → Output: 2 (because 3 - 0 - 1 = 2)\n- Input: \"2 apples and 3 oranges\" and 100 → Output: 95 (because 100 - 2 - 3 = 95)\n- Input: \"100 apples and 1 oranges\" and 120 → Output: 19 (because 120 - 100 - 1 = 19)", "io_examples": [["5 apples and 6 oranges\n19", "8"], ["5 apples and 6 oranges\n21", "10"], ["0 apples and 1 oranges\n3", "2"], ["1 apples and 0 oranges\n3", "2"], ["2 apples and 3 oranges\n100", "95"], ["2 apples and 3 oranges\n5", "0"], ["1 apples and 100 oranges\n120", "19"]]}
{"id": 62, "task": "Given an array representing a branch of a tree that has non-negative integer nodes, your task is to pluck one of the nodes and return it.\n\nThe plucked node should be the node with the smallest even value. If multiple nodes with the same smallest even value are found, return the node that has the smallest index.\n\nThe plucked node should be returned as two values: the smallest even value and its index. If there are no even values or the given array is empty, return an empty result.\n\nInput format: A JSON array of non-negative integers on a single line.\n\nOutput format: \n- If a node is found: Output two lines - the first line contains the smallest even value, the second line contains its index (0-based).\n- If no node is found: Output \"[]\" on a single line.\n\nConstraints:\n- 1 <= array length <= 10000\n- 0 <= node value", "io_examples": [["[4,2,3]", "2\n1"], ["[1,2,3]", "2\n1"], ["[]", "[]"], ["[5, 0, 3, 0, 4, 2]", "0\n1"], ["[1, 2, 3, 0, 5, 3]", "0\n3"], ["[5, 4, 8, 4 ,8]", "4\n1"], ["[7, 6, 7, 1]", "6\n1"], ["[7, 9, 7, 1]", "[]"]]}
{"id": 63, "task": "You are given a non-empty list of positive integers. Return the greatest integer that is greater than zero, and has a frequency greater than or equal to the value of the integer itself. The frequency of an integer is the number of times it appears in the list. If no such a value exists, return -1.\n\nInput format: A single line containing space-separated positive integers representing the list.\nOutput format: A single integer - either the greatest integer satisfying the condition, or -1 if no such integer exists.", "io_examples": [["4 1 2 2 3 1", "2"], ["1 2 2 3 3 3 4 4 4", "3"], ["5 5 4 4 4", "-1"], ["5 5 5 5 1", "1"], ["4 1 4 1 4 4", "4"], ["3 3", "-1"], ["8 8 8 8 8 8 8 8", "8"], ["2 3 3 2 2", "2"], ["1", "1"], ["10", "-1"]]}
{"id": 64, "task": "Given a list of integers, return the list reordered in a \"strange\" sorting pattern.\n\nStrange sorting works as follows:\n1. Start by selecting the minimum value from the list\n2. Then select the maximum value from the remaining integers\n3. Then select the minimum value from the remaining integers\n4. Continue alternating between minimum and maximum until all integers are selected\n\nInput format: A list of integers enclosed in square brackets, with elements separated by commas (e.g., [1, 2, 3, 4]). An empty list is represented as [].\n\nOutput format: Each integer from the reordered list on a separate line. For an empty input list, produce no output.", "io_examples": [["[1, 2, 3, 4]", "1\n4\n2\n3"], ["[5, 6, 7, 8, 9]", "5\n9\n6\n8\n7"], ["[1, 2, 3, 4, 5]", "1\n5\n2\n4\n3"], ["[5, 6, 7, 8, 9, 1]", "1\n9\n5\n8\n6\n7"], ["[5, 5, 5, 5]", "5\n5\n5\n5"], ["[]", ""], ["[1, 2, 3, 4, 5, 6, 7, 8]", "1\n8\n2\n7\n3\n6\n4\n5"], ["[0, 2, 2, 2, 5, 5, -5, -5]", "-5\n5\n-5\n5\n0\n2\n2\n2"], ["[111111]", "111111"]]}
{"id": 65, "task": "Given the lengths of three sides of a triangle, calculate and return the area of the triangle if the three sides form a valid triangle. Otherwise, return -1.\n\nThree sides form a valid triangle when the sum of any two sides is greater than the third side. In other words, for sides a, b, and c: a + b > c AND a + c > b AND b + c > a.\n\nIf the sides form a valid triangle, calculate the area using Heron's formula and round the result to 2 decimal places.\n\nInput format: Three numbers (can be integers or decimals) separated by spaces, representing the lengths of the three sides of a triangle.\n\nOutput format: A single number - either the area of the triangle rounded to exactly 2 decimal places, or -1 if the sides do not form a valid triangle.", "io_examples": [["3 4 5", "6.00"], ["1 2 10", "-1"], ["4 8 5", "8.18"], ["2 2 2", "1.73"], ["1 2 3", "-1"], ["10 5 7", "16.25"], ["2 6 3", "-1"], ["1 1 1", "0.43"], ["2 2 10", "-1"]]}
{"id": 66, "task": "Determine if an object will fly based on two conditions:\n1. The object must be balanced (represented as a palindromic sequence of integers - it reads the same forwards and backwards)\n2. The sum of all elements in the sequence must be less than or equal to a given maximum weight limit\n\nInput format:\n- First line: space-separated integers representing the sequence\n- Second line: a single integer representing the maximum weight limit\n\nOutput format:\n- A single line containing \"true\" if both conditions are met, \"false\" otherwise\n\nExamples:\n- Sequence [1, 2] with weight limit 5: The sum (3) is less than the limit, but the sequence is not palindromic, so the result is false\n- Sequence [3, 2, 3] with weight limit 1: The sequence is palindromic, but the sum (8) exceeds the limit, so the result is false\n- Sequence [3, 2, 3] with weight limit 9: The sequence is palindromic and the sum (8) is within the limit, so the result is true\n- Sequence [3] with weight limit 5: A single element is always palindromic and the sum (3) is within the limit, so the result is true", "io_examples": [["3 2 3\n9", "true"], ["1 2\n5", "false"], ["3\n5", "true"], ["3 2 3\n1", "false"], ["1 2 3\n6", "false"], ["5\n5", "true"]]}
{"id": 67, "task": "Given an array of integers, find the minimum number of elements that need to be changed to make the array palindromic. A palindromic array is an array that reads the same backwards and forwards. In one change, you can change one element to any other element.\n\nInput format: A single line containing space-separated integers representing the array.\n\nOutput format: A single integer representing the minimum number of changes needed to make the array palindromic.", "io_examples": [["1 2 3 5 4 7 9 6", "4"], ["1 2 3 4 3 2 2", "1"], ["1 4 2", "1"], ["1 4 4 2", "1"], ["1 2 3 2 1", "0"], ["3 1 1 3", "0"], ["1", "0"], ["0 1", "1"]]}
{"id": 68, "task": "Write a function that accepts two lists of strings and returns the list that has the total number of characters in all strings of the list less than the other list.\n\nIf the two lists have the same number of characters, return the first list.\n\nInput format: Two lists of strings\nOutput format: One list of strings (the list with fewer total characters, or the first list if equal)", "io_examples": [["\n", ""], ["hi|admin\nhi|hi", "hi\nhi"], ["hi|admin\nhi|hi|admin|project", "hi\nadmin"], ["4\n1|2|3|4|5", "4"], ["hi|admin\nhI|Hi", "hI\nHi"], ["hi|admin\nhI|hi|hi", "hI\nhi\nhi"], ["hi|admin\nhI|hi|hii", "hi\nadmin"], ["\nthis", ""], ["this\n", ""]]}
{"id": 69, "task": "Determine whether a given positive integer is the product of exactly three prime numbers (not necessarily distinct).\n\nInput: A single positive integer less than or equal to 100.\n\nOutput: The text \"True\" if the number can be expressed as the product of exactly three prime numbers, or \"False\" otherwise.\n\nA prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself. The three prime numbers in the product do not need to be distinct - for example, 8 = 2 × 2 × 2 is valid.\n\nExamples:\n- 30 can be expressed as 2 × 3 × 5, so the output is \"True\"\n- 5 is a single prime number (not a product of three primes), so the output is \"False\"\n- 8 can be expressed as 2 × 2 × 2, so the output is \"True\"", "io_examples": [["5", "False"], ["30", "True"], ["8", "True"], ["10", "False"], ["125", "True"], ["105", "True"], ["126", "False"], ["729", "False"], ["891", "False"], ["1001", "True"]]}
{"id": 70, "task": "Write a function that determines whether a number x is a simple power of n.\n\nA number x is considered a simple power of n if there exists a non-negative integer k such that n raised to the power k equals x (i.e., n^k = x).\n\nInput format: Two space-separated integers on a single line: x (the number to check) and n (the base).\n\nOutput format: A single line containing \"true\" if x is a simple power of n, or \"false\" otherwise.\n\nExamples:\n- If x=1 and n=4, the answer is \"true\" (because 4^0 = 1)\n- If x=2 and n=2, the answer is \"true\" (because 2^1 = 2)\n- If x=8 and n=2, the answer is \"true\" (because 2^3 = 8)\n- If x=3 and n=2, the answer is \"false\" (no integer k exists where 2^k = 3)\n- If x=3 and n=1, the answer is \"false\" (1 raised to any positive power is 1, not 3)\n- If x=5 and n=3, the answer is \"false\" (no integer k exists where 3^k = 5)", "io_examples": [["16 2", "true"], ["143214 16", "false"], ["4 2", "true"], ["9 3", "true"], ["16 4", "true"], ["24 2", "false"], ["128 4", "false"], ["12 6", "false"], ["1 1", "true"], ["1 12", "true"]]}
{"id": 71, "task": "Write a program that takes an integer as input and determines whether this integer is a perfect cube of some integer number.\n\nAn integer n is a perfect cube if there exists an integer k such that k³ = n. This includes positive integers, negative integers, and zero.\n\nInput format: A single integer on one line.\n\nOutput format: Output \"True\" if the integer is a perfect cube, otherwise output \"False\".\n\nExamples:\n- 1 is a perfect cube (1³ = 1)\n- 2 is not a perfect cube\n- -1 is a perfect cube ((-1)³ = -1)\n- 64 is a perfect cube (4³ = 64)\n- 0 is a perfect cube (0³ = 0)\n- 180 is not a perfect cube", "io_examples": [["1", "True"], ["2", "False"], ["-1", "True"], ["64", "True"], ["180", "False"], ["1000", "True"], ["0", "True"], ["1729", "False"]]}
{"id": 72, "task": "Write a program that receives a hexadecimal number as a string and counts the number of hexadecimal digits that are primes. A prime number is a natural number greater than 1 that is not a product of two smaller natural numbers.\n\nHexadecimal digits are: 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F.\nPrime numbers are: 2, 3, 5, 7, 11, 13, 17, ...\n\nYou need to count the following hexadecimal digits: 2, 3, 5, 7, B (equals decimal 11), D (equals decimal 13).\n\nInput format: A single line containing a hexadecimal string. The string may be empty. Letters A, B, C, D, E, F are always uppercase.\n\nOutput format: A single integer representing the count of prime hexadecimal digits in the input string.", "io_examples": [["AB", "1"], ["1077E", "2"], ["ABED1A33", "4"], ["2020", "2"], ["123456789ABCDEF0", "6"], ["112233445566778899AABBCCDDEEFF00", "12"], ["", "0"]]}
{"id": 73, "task": "You will be given a number in decimal form and your task is to convert it to binary format. The output should be a string, with each character representing a binary digit. Each character in the string will be '0' or '1'.\n\nThere will be an extra couple of characters 'db' at the beginning and at the end of the string. The extra characters are there to help with the format.\n\nInput: A single non-negative integer in decimal form.\nOutput: A string containing the binary representation of the input number, prefixed and suffixed with \"db\".\n\nExamples:\n- Input: 15, Output: \"db1111db\"\n- Input: 32, Output: \"db100000db\"", "io_examples": [["0", "db0db"], ["32", "db100000db"], ["103", "db1100111db"], ["15", "db1111db"]]}
{"id": 74, "task": "You are given a string s.\nYour task is to check if the string is happy or not.\nA string is happy if its length is at least 3 and every 3 consecutive letters are distinct.\n\nInput format: A single string s\nOutput format: Output \"True\" if the string is happy, \"False\" otherwise", "io_examples": [["a", "False"], ["aa", "False"], ["abcd", "True"], ["aabb", "False"], ["adb", "True"], ["xyy", "False"], ["iopaxpoi", "True"], ["iopaxioi", "False"]]}
{"id": 75, "task": "Convert a list of GPA (Grade Point Average) values to letter grades using the following grading scale:\n\nGPA       | Letter grade\n4.0       | A+\n> 3.7     | A \n> 3.3     | A- \n> 3.0     | B+\n> 2.7     | B \n> 2.3     | B-\n> 2.0     | C+\n> 1.7     | C\n> 1.3     | C-\n> 1.0     | D+ \n> 0.7     | D \n> 0.0     | D-\n0.0       | E\n\nInput format: A single line containing space-separated decimal numbers representing GPA values (ranging from 0.0 to 4.0).\n\nOutput format: Each letter grade on a separate line, corresponding to each input GPA value in order.\n\nExample:\nInput: 4.0 3 1.7 2 3.5\nOutput:\nA+\nB\nC-\nC\nA-", "io_examples": [["4.0 3 1.7 2 3.5", "A+\nB\nC-\nC\nA-"], ["1.2", "D+"], ["0.5", "D-"], ["0.0", "E"], ["1 0.3 1.5 2.8 3.3", "D\nD-\nC-\nB\nB+"], ["0 0.7", "E\nD-"]]}
{"id": 76, "task": "Given a positive integer n, return the count of n-digit positive integers that start or end with 1.\n\nInput: A single positive integer n representing the number of digits.\nOutput: A single integer representing the count of n-digit positive integers that start or end with 1.\n\nNote: An n-digit positive integer is an integer with exactly n digits (the first digit cannot be 0).", "io_examples": [["1", "1"], ["2", "18"], ["3", "180"], ["4", "1800"], ["5", "18000"]]}
{"id": 77, "task": "Given a positive integer N, calculate the sum of all its digits, then convert that sum to its binary representation.\n\nInput format: A single positive integer N where 0 ≤ N ≤ 10000.\n\nOutput format: A string representing the binary representation of the digit sum (without any prefix like \"0b\").\n\nExample:\n- For N = 1000, the digits are 1, 0, 0, 0. Their sum is 1. The binary representation of 1 is \"1\".\n- For N = 150, the digits are 1, 5, 0. Their sum is 6. The binary representation of 6 is \"110\".\n- For N = 147, the digits are 1, 4, 7. Their sum is 12. The binary representation of 12 is \"1100\".", "io_examples": [["1000", "1"], ["150", "110"], ["147", "1100"], ["333", "1001"], ["963", "10010"]]}
{"id": 78, "task": "Given a non-empty list of integers, calculate the sum of all even-valued elements that are located at odd indices (using 0-based indexing, meaning positions 1, 3, 5, etc.).\n\nInput format: A single line containing a list of integers in JSON array format (e.g., [4, 2, 6, 7]).\n\nOutput format: A single integer representing the sum of even elements at odd indices.", "io_examples": [["[4, 88]", "88"], ["[4, 5, 6, 7, 2, 122]", "122"], ["[4, 0, 6, 7]", "0"], ["[4, 4, 6, 8]", "12"]]}
{"id": 79, "task": "Write a program that takes a string and returns an ordered version of it. The ordered version of a string is created by replacing each word (separated by space) with a new word where all the characters are arranged in ascending order based on ASCII value. The order of words and blank spaces in the sentence must be preserved.\n\nInput format: A single line containing a string (may be empty).\n\nOutput format: A single line containing the transformed string where each word has its characters sorted in ascending ASCII order.", "io_examples": [["Hi", "Hi"], ["hello", "ehllo"], ["number", "bemnru"], ["abcd", "abcd"], ["Hello World!!!", "Hello !!!Wdlor"], ["", ""], ["Hi. My name is Mister Robot. How are you?", ".Hi My aemn is Meirst .Rboot How aer ?ouy"]]}
{"id": 80, "task": "You are given a 2-dimensional data structure as a nested list, which is similar to a matrix. However, unlike matrices, each row may contain a different number of columns.\n\nGiven a 2D list and an integer x, find all occurrences of x in the list and return a list of coordinate pairs (row, column), where both row and column indices start at 0.\n\nThe coordinates should be sorted with the following rules:\n1. First, sort by row in ascending order\n2. Within each row, sort by column in descending order\n\nInput format:\n- First line: A 2D list in JSON format (e.g., [[1,2,3],[4,5,6]])\n- Second line: An integer x to search for\n\nOutput format:\n- Each coordinate pair on a separate line, with row and column separated by a space\n- If no occurrences are found, output nothing (empty output)", "io_examples": [["[[1,2,3,4,5,6],[1,2,3,4,1,6],[1,2,3,4,5,1]]\n1", "0 0\n1 4\n1 0\n2 5\n2 0"], ["[[1,2,3,4,5,6],[1,2,3,4,5,6],[1,2,3,4,5,6],[1,2,3,4,5,6],[1,2,3,4,5,6],[1,2,3,4,5,6]]\n2", "0 1\n1 1\n2 1\n3 1\n4 1\n5 1"], ["[[1,2,3,4,5,6],[1,2,3,4,5,6],[1,1,3,4,5,6],[1,2,1,4,5,6],[1,2,3,1,5,6],[1,2,3,4,1,6],[1,2,3,4,5,1]]\n1", "0 0\n1 0\n2 1\n2 0\n3 2\n3 0\n4 3\n4 0\n5 4\n5 0\n6 5\n6 0"], ["[]\n1", ""], ["[[1]]\n2", ""], ["[[],[1],[1,2,3]]\n3", "2 2"]]}
{"id": 81, "task": "Given an array of non-negative integers, return a sorted copy of the array according to the following rules:\n- If the sum of the first element and the last element is odd, sort the array in ascending order\n- If the sum of the first element and the last element is even, sort the array in descending order\n- If the array is empty, return an empty array\n- Do not modify the original array\n\nInput format: A JSON array of non-negative integers on a single line\nOutput format: Each element of the sorted array on a separate line. For an empty array, produce no output.\n\nExamples:\n- An empty array produces no output\n- A single element array returns that element\n- Array [2, 4, 3, 0, 1, 5]: first + last = 2 + 5 = 7 (odd), so sort ascending\n- Array [2, 4, 3, 0, 1, 5, 6]: first + last = 2 + 6 = 8 (even), so sort descending", "io_examples": [["[]", ""], ["[5]", "5"], ["[2, 4, 3, 0, 1, 5]", "0\n1\n2\n3\n4\n5"], ["[2, 4, 3, 0, 1, 5, 6]", "6\n5\n4\n3\n2\n1\n0"], ["[2, 1]", "1\n2"], ["[15, 42, 87, 32, 11, 0]", "0\n11\n15\n32\n42\n87"], ["[21, 14, 23, 11]", "23\n21\n14\n11"]]}
{"id": 82, "task": "Create a function that takes a string as input and returns an encrypted version of that string. The encryption works by shifting each lowercase letter in the alphabet forward by 4 positions. \n\nThe encryption rules are:\n- Each lowercase letter (a-z) should be shifted forward by 4 positions in the alphabet\n- The shift wraps around, so after 'z' comes 'a' (using modulo 26 arithmetic)\n- Any character that is not a lowercase letter should remain unchanged\n\nInput format: A single line containing a string to be encrypted\nOutput format: A single line containing the encrypted string\n\nExamples:\n- Input 'hi' produces output 'lm' (h->l, i->m)\n- Input 'asdfghjkl' produces output 'ewhjklnop'\n- Input 'gf' produces output 'kj'\n- Input 'et' produces output 'ix'", "io_examples": [["hi", "lm"], ["asdfghjkl", "ewhjklnop"], ["gf", "kj"], ["et", "ix"], ["faewfawefaewg", "jeiajeaijeiak"], ["hellomyfriend", "lippsqcjvmirh"], ["dxzdlmnilfuhmilufhlihufnmlimnufhlimnufhfucufh", "hbdhpqrmpjylqmpyjlpmlyjrqpmqryjlpmqryjljygyjl"], ["a", "e"]]}
{"id": 83, "task": "Given a list of integers, find the 2nd smallest element after removing all duplicate values.\n\nInput format: A single line containing space-separated integers. An empty line represents an empty list.\n\nOutput format: A single integer representing the 2nd smallest unique element, or the string \"None\" if there is no such element (i.e., when the list is empty or contains fewer than 2 unique values).\n\nExamples:\n- For the list [1, 2, 3, 4, 5], the 2nd smallest element is 2\n- For the list [5, 1, 4, 3, 2], the 2nd smallest element is 2\n- For an empty list, return None\n- For the list [1, 1], after removing duplicates there is only one unique element, so return None\n- For the list [1, 1, 1, 1, 0], after removing duplicates we have [0, 1], so the 2nd smallest is 1\n- For the list [-35, 34, 12, -45], the sorted unique elements are [-45, -35, 12, 34], so the 2nd smallest is -35", "io_examples": [["1 2 3 4 5", "2"], ["5 1 4 3 2", "2"], ["", "None"], ["1 1", "None"], ["1 1 1 1 0", "1"], ["-35 34 12 -45", "-35"]]}
{"id": 84, "task": "You'll be given a string of words, and your task is to count the number of boredoms. A boredom is a sentence that starts with the word \"I\" followed by a space. Sentences are delimited by '.', '?' or '!'.\n\nInput: A single line containing a string of words.\nOutput: A single integer representing the count of sentences that start with \"I \" (the word \"I\" followed by a space).", "io_examples": [["Hello world", "0"], ["Is the sky blue?", "0"], ["I love It !", "1"], ["bIt", "0"], ["I feel good today. I will be productive. will kill It", "2"], ["You and I are going for a walk", "0"]]}
{"id": 85, "task": "Create a function that takes 3 numbers.\nReturns true if one of the numbers is equal to the sum of the other two, and all numbers are integers.\nReturns false in any other cases.\n\nInput format: Three space-separated numbers (which may be integers or decimal numbers)\nOutput format: \"True\" or \"False\"\n\nExamples:\n- Input: 5, 2, 7 → Output: True (because 5 + 2 = 7 and all are integers)\n- Input: 3, 2, 2 → Output: False (no number equals the sum of the other two)\n- Input: 3, -2, 1 → Output: True (because 3 + (-2) = 1 and all are integers)\n- Input: 3.6, -2.2, 2 → Output: False (not all numbers are integers)", "io_examples": [["2 3 1", "True"], ["2.5 2 3", "False"], ["1.5 5 3.5", "False"], ["2 6 2", "False"], ["4 2 2", "True"], ["2.2 2.2 2.2", "False"], ["-4 6 2", "True"], ["2 1 1", "True"], ["3 4 7", "True"], ["3.0 4 7", "False"]]}
{"id": 86, "task": "Write a program that encodes a message using the following rules:\n\n1. Swap the case of all letters (uppercase letters become lowercase, lowercase letters become uppercase)\n2. After swapping the case, replace each vowel with the letter that appears 2 positions ahead of it in the alphabet:\n   - 'a' becomes 'c'\n   - 'e' becomes 'g'\n   - 'i' becomes 'k'\n   - 'o' becomes 'q'\n   - 'u' becomes 'w'\n   - 'A' becomes 'C'\n   - 'E' becomes 'G'\n   - 'I' becomes 'K'\n   - 'O' becomes 'Q'\n   - 'U' becomes 'W'\n\nThe input will be a single line containing a message consisting only of letters and spaces. The output should be the encoded message.", "io_examples": [["test", "TGST"], ["TEST", "tgst"], ["Mudasir", "mWDCSKR"], ["YES", "ygs"], ["This is a message", "tHKS KS C MGSSCGG"], ["I DoNt KnOw WhAt tO WrItE", "k dQnT kNqW wHcT Tq wRkTg"]]}
{"id": 87, "task": "You are given a list of integers. You need to find the largest prime value in the list and return the sum of its digits.\n\nA prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself.\n\nInput format: A sequence of space-separated integers representing the list.\n\nOutput format: A single integer representing the sum of the digits of the largest prime number found in the list. If no prime number exists in the list, return 0.", "io_examples": [["0 3 2 1 3 5 7 4 5 5 5 2 181 32 4 32 3 2 32 324 4 3", "10"], ["1 0 1 8 2 4597 2 1 3 40 1 2 1 2 4 2 5 1", "25"], ["1 3 1 32 5107 34 83278 109 163 23 2323 32 30 1 9 3", "13"], ["0 724 32 71 99 32 6 0 5 91 83 0 5 6", "11"], ["0 81 12 3 1 21", "3"], ["0 8 1 2 1 7", "7"], ["8191", "19"], ["8191 123456 127 7", "19"], ["127 97 8192", "10"]]}
{"id": 88, "task": "Given a dictionary (map/associative array), determine if all keys are strings in lower case or all keys are strings in upper case. Return True if either condition is met, otherwise return False. The function should return False if the given dictionary is empty.\n\nInput format:\n- First line: an integer n representing the number of key-value pairs in the dictionary\n- Next n lines: each line contains a key type followed by a space and the key value\n  - Key type \"s\" indicates a string key\n  - Key type \"i\" indicates an integer key\n  - The key value follows after the space\n\nOutput format:\n- A single line containing \"True\" or \"False\"\n\nRules:\n- Return True if all keys are strings and all are lowercase\n- Return True if all keys are strings and all are uppercase\n- Return False if the dictionary is empty\n- Return False if any key is not a string\n- Return False if keys are strings but have mixed casing (some uppercase, some lowercase)\n- Return False if any string key contains both uppercase and lowercase letters (like \"Name\")", "io_examples": [["2\ns p\ns b", "True"], ["3\ns p\ns A\ns B", "False"], ["3\ns p\ni 5\ns a", "False"], ["3\ns Name\ns Age\ns City", "False"], ["2\ns STATE\ns ZIP", "True"], ["2\ns fruit\ns taste", "True"], ["0", "False"]]}
{"id": 89, "task": "Given a non-negative integer n, find all prime numbers that are less than n and return them in ascending order.\n\nInput format: A single non-negative integer n.\n\nOutput format: Each prime number less than n should be printed on a separate line, in ascending order. If there are no prime numbers less than n, produce no output.", "io_examples": [["5", "2\n3"], ["6", "2\n3\n5"], ["7", "2\n3\n5"], ["10", "2\n3\n5\n7"], ["0", ""], ["22", "2\n3\n5\n7\n11\n13\n17\n19"], ["1", ""], ["18", "2\n3\n5\n7\n11\n13\n17"]]}
{"id": 90, "task": "Complete a function that takes two integers and returns the product of their unit digits (the last digit of each number). The unit digit should be treated as its absolute value, so negative numbers should have their unit digit's absolute value taken before multiplication.\n\nInput format: Two space-separated integers on a single line.\nOutput format: A single integer representing the product of the absolute values of the unit digits.\n\nExamples:\n- For inputs 148 and 412, the unit digits are 8 and 2, so the result is 16.\n- For inputs 19 and 28, the unit digits are 9 and 8, so the result is 72.\n- For inputs 2020 and 1851, the unit digits are 0 and 1, so the result is 0.\n- For inputs 14 and -15, the unit digits are 4 and 5 (absolute value), so the result is 20.", "io_examples": [["148 412", "16"], ["19 28", "72"], ["2020 1851", "0"], ["14 -15", "20"], ["76 67", "42"], ["17 27", "49"], ["0 1", "0"], ["0 0", "0"]]}
{"id": 91, "task": "Given a string, count the number of uppercase vowels (A, E, I, O, U) that appear at even-indexed positions (positions 0, 2, 4, 6, etc., where the first character is at position 0).\n\nInput format: A single line containing a string (may be empty).\n\nOutput format: A single integer representing the count of uppercase vowels at even indices.", "io_examples": [["aBCdEf", "1"], ["abcdefg", "0"], ["dBBE", "0"], ["B", "0"], ["U", "1"], ["", "0"], ["EEEE", "2"]]}
{"id": 92, "task": "Create a program that takes a value (string) representing a number and returns the closest integer to it. If the number is equidistant from two integers, round it away from zero.\n\nInput format: A single line containing a string representation of a number (which may be an integer or a decimal number).\n\nOutput format: A single integer representing the closest integer to the input value.\n\nRounding away from zero means that if the given number is equidistant from two integers (i.e., has a decimal part of exactly 0.5), the one you should return is the one that is the farthest from zero. For example, \"14.5\" should return 15 and \"-14.5\" should return -15.", "io_examples": [["10", "10"], ["14.5", "15"], ["-15.5", "-16"], ["15.3", "15"], ["0", "0"]]}
{"id": 93, "task": "Given a positive integer n, you have to make a pile of n levels of stones.\nThe first level has n stones.\nThe number of stones in the next level is:\n    - the next odd number if n is odd.\n    - the next even number if n is even.\nReturn the number of stones in each level, where each value represents the number of stones in that level (starting from level 1).\n\nInput: A single positive integer n\nOutput: n lines, each containing the number of stones at that level", "io_examples": [["3", "3\n5\n7"], ["4", "4\n6\n8\n10"], ["5", "5\n7\n9\n11\n13"], ["6", "6\n8\n10\n12\n14\n16"], ["8", "8\n10\n12\n14\n16\n18\n20\n22"]]}
{"id": 94, "task": "Given two positive integers x and y, find the biggest even integer that is in the range [x, y] inclusive. If there's no such number, return -1.\n\nInput format: Two space-separated positive integers x and y on a single line.\nOutput format: A single integer - either the biggest even integer in the range [x, y] inclusive, or -1 if no such number exists.\n\nExamples:\n- For x=12 and y=15, the biggest even integer in range is 14\n- For x=13 and y=12, since x > y, there is no valid range, so return -1", "io_examples": [["12 15", "14"], ["13 12", "-1"], ["33 12354", "12354"], ["5234 5233", "-1"], ["6 29", "28"], ["27 10", "-1"], ["7 7", "-1"], ["546 546", "546"]]}
{"id": 95, "task": "Given two positive integers n and m, compute the average of all integers from n through m (including both n and m). Round the result to the nearest integer and convert that integer to its binary representation. If n is greater than m, return -1.\n\nInput format: Two space-separated integers n and m on a single line.\n\nOutput format: \n- If n > m: output \"-1\"\n- Otherwise: output the binary representation of the rounded average as a string with \"0b\" prefix (e.g., \"0b11\" for binary 11)\n\nThe average should be rounded to the nearest integer using standard rounding rules (0.5 rounds up).", "io_examples": [["1 5", "0b11"], ["7 5", "-1"], ["10 20", "0b1111"], ["20 33", "0b11010"], ["7 13", "0b1010"], ["5 5", "0b101"], ["964 977", "0b1111001010"], ["996 997", "0b1111100100"]]}
{"id": 96, "task": "Given a list of positive integers, return a sorted list of all elements that contain only odd digits (1, 3, 5, 7, 9). A number should be excluded if it contains any even digit (0, 2, 4, 6, 8).\n\nInput format: A single line containing space-separated positive integers.\n\nOutput format: Each qualifying number on a separate line, sorted in increasing order. If no numbers qualify, output nothing (empty output).\n\nNote: The returned list should be sorted in increasing order.", "io_examples": [["15 33 1422 1", "1\n15\n33"], ["152 323 1422 10", ""], ["12345 2033 111 151", "111\n151"], ["135 103 31", "31\n135"]]}
{"id": 97, "task": "Given an array of integers, process it as follows:\n1. Filter the array to keep only integers that are between 1 and 9 inclusive\n2. Sort the filtered integers in descending order (largest to smallest)\n3. Replace each digit with its corresponding word name: 1→\"One\", 2→\"Two\", 3→\"Three\", 4→\"Four\", 5→\"Five\", 6→\"Six\", 7→\"Seven\", 8→\"Eight\", 9→\"Nine\"\n\nInput format: A JSON array of integers on a single line\nOutput format: Each word name on a separate line, in the order determined by the descending sort. If the result is empty, output nothing.\n\nExamples:\n- For [2, 1, 1, 4, 5, 8, 2, 3], after filtering (all valid), sorting descending gives [8, 5, 4, 3, 2, 2, 1, 1], which converts to \"Eight\", \"Five\", \"Four\", \"Three\", \"Two\", \"Two\", \"One\", \"One\"\n- For an empty array [], return nothing\n- For [1, -1, 55], only 1 is valid, so return \"One\"", "io_examples": [["[2, 1, 1, 4, 5, 8, 2, 3]", "Eight\nFive\nFour\nThree\nTwo\nTwo\nOne\nOne"], ["[]", ""], ["[1, -1, 55]", "One"], ["[1, -1, 3, 2]", "Three\nTwo\nOne"], ["[9, 4, 8]", "Nine\nEight\nFour"]]}
{"id": 98, "task": "Given a positive integer n, generate a sequence of n numbers where each position i (starting from index 1) is calculated as follows:\n- If i is even: the value is the factorial of i (the product of all positive integers from 1 to i, i.e., 1 * 2 * 3 * ... * i)\n- If i is odd: the value is the sum of all positive integers from 1 to i (i.e., 1 + 2 + 3 + ... + i)\n\nInput format: A single positive integer n\nOutput format: n integers, each on a separate line, representing the sequence values at positions 1 through n\n\nExample: For n=5, the sequence is:\n- Position 1 (odd): sum from 1 to 1 = 1\n- Position 2 (even): factorial of 2 = 2\n- Position 3 (odd): sum from 1 to 3 = 6\n- Position 4 (even): factorial of 4 = 24\n- Position 5 (odd): sum from 1 to 5 = 15", "io_examples": [["5", "1\n2\n6\n24\n15"], ["7", "1\n2\n6\n24\n15\n720\n28"], ["1", "1"], ["3", "1\n2\n6"]]}
{"id": 99, "task": "Given a positive integer n, count how many palindromic integers exist in the range from 1 to n (inclusive), and categorize them by whether they are even or odd numbers.\n\nA palindromic integer is a number that reads the same forwards and backwards (e.g., 1, 2, 11, 121, 1331).\n\nAn integer is considered \"even\" if it is divisible by 2 (e.g., 2, 4, 6, 8), and \"odd\" if it is not divisible by 2 (e.g., 1, 3, 5, 7, 9).\n\nInput: A single positive integer n where 1 ≤ n ≤ 1000\n\nOutput: Two integers on separate lines:\n- First line: the count of even palindromic integers in the range [1, n]\n- Second line: the count of odd palindromic integers in the range [1, n]", "io_examples": [["3", "1\n2"], ["12", "4\n6"], ["1", "0\n1"], ["123", "8\n13"], ["63", "6\n8"], ["25", "5\n6"], ["19", "4\n6"], ["9", "4\n5"]]}
{"id": 100, "task": "Write a function that takes an array of integers and returns the count of elements which have a sum of digits greater than 0.\n\nFor negative numbers, the first digit is treated as negative while all other digits remain positive. For example, the number -123 has digits -1, 2, and 3, so its sum is -1 + 2 + 3 = 4.\n\nInput format: A single line containing space-separated integers. An empty line or no input represents an empty array.\n\nOutput format: A single integer representing the count of numbers with positive digit sums.", "io_examples": [["", "0"], ["-1 -2 0", "0"], ["1 1 2 -2 3 4 5", "6"], ["1 6 9 -6 0 1 5", "5"], ["1 100 98 -7 1 -1", "4"], ["12 23 34 -45 -56 0", "5"], ["0 1", "1"], ["1", "1"]]}
{"id": 101, "task": "Given a sequence of N unique integers (which may be randomly ordered), determine if it is possible to obtain a sequence sorted in non-decreasing order by performing right shift operations any number of times.\n\nOne right shift operation means shifting all elements of the sequence by one position in the right direction. The last element of the sequence will be moved to the starting position (index 0).\n\nIf it is possible to obtain the sorted sequence by performing the above operation, output \"True\", otherwise output \"False\".\n\nIf the given sequence is empty, output \"True\".\n\nInput format: A single line containing space-separated integers representing the sequence. An empty line represents an empty sequence.\n\nOutput format: A single line containing either \"True\" or \"False\".\n\nExample:\nFor the sequence [3, 4, 5, 1, 2], the answer is \"True\" because by performing 2 right shift operations, non-decreasing order can be achieved.\nFor the sequence [3, 5, 4, 1, 2], the answer is \"False\" because it is not possible to get non-decreasing order by performing any number of right shift operations.", "io_examples": [["3 4 5 1 2", "True"], ["3 5 10 1 2", "True"], ["4 3 1 2", "False"], ["3 5 4 1 2", "False"], ["", "True"]]}
{"id": 102, "task": "Given two lists of numbers, determine whether it is possible to perform an exchange of elements between them to make the first list contain only even numbers. There is no limit on the number of exchanged elements between the two lists. If it is possible to exchange elements to make all elements of the first list even, output \"YES\". Otherwise, output \"NO\". Both input lists will be non-empty.\n\nInput format: Two lines, each containing space-separated integers. The first line represents the first list, and the second line represents the second list.\n\nOutput format: A single line containing either \"YES\" or \"NO\".", "io_examples": [["1 2 3 4\n1 2 3 4", "YES"], ["1 2 3 4\n1 5 3 4", "NO"], ["1 2 3 4\n2 1 4 3", "YES"], ["5 7 3\n2 6 4", "YES"], ["5 7 3\n2 6 3", "NO"], ["3 2 6 1 8 9\n3 5 5 1 1 1", "NO"], ["100 200\n200 200", "YES"]]}
{"id": 103, "task": "Given a string representing space-separated lowercase letters, find the letter(s) with the most repetitions and return them with their corresponding count. If several letters have the same occurrence count and that count is the maximum, return all of them.\n\nInput: A single line containing a string of space-separated lowercase letters (the string may be empty).\n\nOutput: For each letter that has the maximum occurrence count, output a line containing the letter followed by a space and then the count. The output should be sorted alphabetically by letter. If the input is empty, produce no output.", "io_examples": [["a b b a", "a 2\nb 2"], ["a b c a b", "a 2\nb 2"], ["a b c d g", "a 1\nb 1\nc 1\nd 1\ng 1"], ["r t g", "g 1\nr 1\nt 1"], ["b b b b a", "b 4"], ["", ""], ["a", "a 1"]]}
{"id": 104, "task": "Given a list of strings where each string consists of only digits, process each string to count how many odd digits it contains. For each string in the input, generate a formatted output string following this template:\n\n\"the number of odd elements [n]n the str[n]ng [n] of the [n]nput.\"\n\nwhere [n] should be replaced with the count of odd digits (1, 3, 5, 7, 9) found in that string.\n\nInput format:\n- First line: an integer representing the number of strings\n- Following lines: each line contains a string consisting of only digits\n\nOutput format:\n- For each input string, output one line containing the formatted string with the odd digit count replacing the placeholders in the template", "io_examples": [["1\n1234567", "the number of odd elements 4n the str4ng 4 of the 4nput."], ["2\n3\n11111111", "the number of odd elements 1n the str1ng 1 of the 1nput.\nthe number of odd elements 8n the str8ng 8 of the 8nput."], ["3\n271\n137\n314", "the number of odd elements 2n the str2ng 2 of the 2nput.\nthe number of odd elements 3n the str3ng 3 of the 3nput.\nthe number of odd elements 2n the str2ng 2 of the 2nput."]]}
{"id": 105, "task": "Given an array of integers, find the minimum sum of any non-empty contiguous sub-array.\n\nA sub-array is a contiguous sequence of elements within the array. You need to find the sub-array (containing at least one element) which has the smallest sum and return that sum.\n\nInput format: A sequence of space-separated integers representing the array.\n\nOutput format: A single integer representing the minimum sum of any non-empty sub-array.\n\nExamples:\n- For the array [2, 3, 4, 1, 2, 4], the minimum sum is 1 (the sub-array [1])\n- For the array [-1, -2, -3], the minimum sum is -6 (the entire array)", "io_examples": [["2 3 4 1 2 4", "1"], ["-1 -2 -3", "-6"], ["-1 -2 -3 2 -10", "-14"], ["-9999999999999999", "-9999999999999999"], ["0 10 20 1000000", "0"], ["-1 -2 -3 10 -5", "-6"], ["100 -1 -2 -3 10 -5", "-6"], ["10 11 13 8 3 4", "3"], ["100 -33 32 -1 0 -2", "-33"], ["-10", "-10"], ["7", "7"], ["1 -1", "-1"]]}
{"id": 106, "task": "You are given a rectangular grid of wells. Each row represents a single well, and each 1 in a row represents a single unit of water. Each well has a corresponding bucket that can be used to extract water from it, and all buckets have the same capacity. Your task is to use the buckets to empty the wells. Output the number of times you need to lower the buckets.\n\nInput format: A JSON object with two fields:\n- \"grid\": a 2D array where each row represents a well, and each element is either 0 or 1\n- \"capacity\": an integer representing the bucket capacity\n\nOutput format: A single integer representing the minimum number of times buckets need to be lowered to empty all wells.\n\nConstraints:\n- All wells have the same length\n- 1 <= number of wells <= 100\n- 1 <= length of each well <= 100\n- Each grid element is either 0 or 1\n- 1 <= capacity <= 10", "io_examples": [["{\"grid\": [[0,0,1,0], [0,1,0,0], [1,1,1,1]], \"capacity\": 1}", "6"], ["{\"grid\": [[0,0,1,1], [0,0,0,0], [1,1,1,1], [0,1,1,1]], \"capacity\": 2}", "5"], ["{\"grid\": [[0,0,0], [0,0,0]], \"capacity\": 5}", "0"], ["{\"grid\": [[1,1,1,1], [1,1,1,1]], \"capacity\": 2}", "4"], ["{\"grid\": [[1,1,1,1], [1,1,1,1]], \"capacity\": 9}", "2"]]}
{"id": 107, "task": "Sort an array of integers according to the number of ones in their binary representation in ascending order. For numbers with the same count of ones in their binary representation, sort them based on their decimal value in ascending order.\n\nFor negative numbers, count the ones in the binary representation of their absolute value.\n\nInput format: A line containing space-separated integers.\nOutput format: Each integer from the sorted array on a new line.\n\nIf the input is empty, produce no output.", "io_examples": [["1 5 2 3 4", "1\n2\n4\n3\n5"], ["-2 -3 -4 -5 -6", "-4\n-2\n-6\n-5\n-3"], ["1 0 2 3 4", "0\n1\n2\n4\n3"], ["2 5 77 4 5 3 5 7 2 3 4", "2\n2\n4\n4\n3\n3\n5\n5\n5\n7\n77"], ["3 6 44 12 32 5", "32\n3\n5\n6\n12\n44"], ["2 4 8 16 32", "2\n4\n8\n16\n32"]]}
{"id": 108, "task": "Given a string and a natural number n, return all words from the string that contain exactly n consonants, in the order these words appear in the string.\n\nA consonant is any letter that is not a vowel. The vowels are: a, e, i, o, u (case-insensitive).\n\nIf the string is empty, return an empty result.\n\nInput format:\n- First line: a string containing only letters and spaces\n- Second line: a natural number n\n\nOutput format:\n- Each word that contains exactly n consonants, printed on a separate line\n- If no words match, produce no output", "io_examples": [["Mary had a little lamb\n4", "little"], ["Mary had a little lamb\n3", "Mary\nlamb"], ["simple white space\n2", ""], ["Hello world\n4", "world"], ["Uncle sam\n3", "Uncle"], ["\n4", ""], ["a b c d e f\n1", "b\nc\nd\nf"]]}
{"id": 109, "task": "Given a word containing only English letters, find the closest vowel from the right side of the word that stands between two consonants. \n\nVowels are defined as: a, e, i, o, u, A, E, I, O, U (case-sensitive).\nConsonants are all other English letters.\n\nRules:\n- Search from right to left through the word\n- The vowel must have a consonant immediately before it and a consonant immediately after it\n- Vowels at the beginning (first position) or ending (last position) of the word do not count\n- If no such vowel exists, return an empty string\n\nInput format: A single word (string containing only English letters)\nOutput format: A single character (the vowel found) or an empty string if no valid vowel exists", "io_examples": [["yogurt", "u"], ["full", "u"], ["easy", ""], ["eAsy", ""], ["ali", ""], ["bad", "a"], ["most", "o"], ["ab", ""], ["ba", ""], ["quick", ""], ["anime", "i"], ["Asia", ""], ["Above", "o"]]}
{"id": 110, "task": "Given an array of integers and a positive integer k, find the k maximum (largest) numbers in the array and return them in sorted ascending order.\n\nInput format:\n- First line: A non-negative integer k\n- Second line: Space-separated integers representing the array\n\nOutput format:\n- Each number from the result on a new line, in sorted ascending order\n- If k is 0, output nothing (empty result)\n\nConstraints:\n- The length of the array will be in the range of [1, 1000]\n- The elements in the array will be in the range of [-1000, 1000]\n- 0 <= k <= length of the array\n\nExample 1:\nInput: k = 3, array = [-3, -4, 5]\nOutput: [-4, -3, 5]\n\nExample 2:\nInput: k = 2, array = [4, -4, 4]\nOutput: [4, 4]\n\nExample 3:\nInput: k = 1, array = [-3, 2, 1, 2, -1, -2, 1]\nOutput: [2]", "io_examples": [["3\n-3 -4 5", "-4\n-3\n5"], ["2\n4 -4 4", "4\n4"], ["1\n-3 2 1 2 -1 -2 1", "2"], ["3\n123 -123 20 0 1 2 -3", "2\n20\n123"], ["4\n-123 20 0 1 2 -3", "0\n1\n2\n20"], ["7\n5 15 0 3 -13 -8 0", "-13\n-8\n0\n0\n3\n5\n15"], ["2\n-1 0 2 5 3 -10", "3\n5"], ["1\n1 0 5 -7", "5"], ["2\n4 -4", "-4\n4"], ["2\n-10 10", "-10\n10"], ["0\n1 2 3 -23 243 -400 0", ""]]}
{"id": 111, "task": "Given a non-empty list of integers, calculate the sum of all odd elements that are located at even positions (using 0-based indexing, where the first element is at position 0, the second at position 1, etc.).\n\nInput format: A single line containing space-separated integers representing the list.\n\nOutput format: A single integer representing the sum of all odd elements at even positions.", "io_examples": [["5 8 7 1", "12"], ["3 3 3 3 3", "9"], ["30 13 24 321", "0"], ["5 9", "5"], ["2 4 8", "0"], ["30 13 23 32", "23"], ["3 13 2 9", "3"]]}
{"id": 112, "task": "Given a non-empty array of integers and an integer k, calculate the sum of elements that have at most two digits from the first k elements of the array.\n\nAn element has \"at most two digits\" if its string representation (including the minus sign for negative numbers) has at most 2 characters. This includes:\n- Single-digit positive numbers: 0-9\n- Single-digit negative numbers: -9 to -1\n- Two-digit positive numbers: 10-99\n- Two-digit negative numbers: -99 to -10\n\nInput format:\n- First line: space-separated integers representing the array\n- Second line: a single integer k\n\nOutput format:\n- A single integer representing the sum\n\nConstraints:\n- The array has at least 1 element and at most 100 elements\n- k is at least 1 and at most the length of the array", "io_examples": [["1 -2 -3 41 57 76 87 88 99\n3", "-4"], ["111 121 3 4000 5 6\n2", "0"], ["11 21 3 90 5 6 7 8 9\n4", "125"], ["111 21 3 4000 5 6 7 8 9\n4", "24"], ["1\n1", "1"]]}
{"id": 113, "task": "Given a positive integer n, return a sorted list that has the odd numbers in the Collatz sequence.\n\nThe Collatz conjecture is a conjecture in mathematics that concerns a sequence defined as follows: start with any positive integer n. Then each term is obtained from the previous term as follows: if the previous term is even, the next term is one half of the previous term. If the previous term is odd, the next term is 3 times the previous term plus 1. The conjecture is that no matter what value of n, the sequence will always reach 1.\n\nNote: \n    1. Collatz(1) is [1].\n    2. The returned list should be sorted in increasing order.\n\nInput format: A single positive integer n.\nOutput format: Each odd number from the Collatz sequence, one per line, in increasing order.", "io_examples": [["14", "1\n5\n7\n11\n13\n17"], ["5", "1\n5"], ["12", "1\n3\n5"], ["1", "1"]]}
{"id": 114, "task": "Write a program that validates a given date string and returns True if the date is valid, otherwise False.\n\nThe date is valid if all of the following rules are satisfied:\n1. The date string is not empty.\n2. The number of days is not less than 1 or higher than 31 days for months 1, 3, 5, 7, 8, 10, 12. The number of days is not less than 1 or higher than 30 days for months 4, 6, 9, 11. The number of days is not less than 1 or higher than 29 for month 2.\n3. The months should not be less than 1 or higher than 12.\n4. The date should be in the format: mm-dd-yyyy (two digits for month, two digits for day, four digits for year, separated by dashes)\n\nInput: A single line containing a date string.\nOutput: A single line containing \"True\" if the date is valid, \"False\" otherwise.", "io_examples": [["03-11-2000", "True"], ["15-01-2012", "False"], ["04-0-2040", "False"], ["06-04-2020", "True"], ["01-01-2007", "True"], ["03-32-2011", "False"], ["", "False"], ["04-31-3000", "False"], ["06-06-2005", "True"], ["21-31-2000", "False"], ["04-12-2003", "True"], ["04122003", "False"], ["20030412", "False"], ["2003-04", "False"], ["2003-04-12", "False"], ["04-2003", "False"], ["06/04/2020", "False"]]}
{"id": 115, "task": "Given a string of text, process it according to the following priority rules:\n\n1. If the string contains any whitespace characters, split the string on whitespace and return the resulting list of words.\n2. Otherwise, if the string contains any commas (','), split the string on commas and return the resulting list of words.\n3. Otherwise, count and return the number of lowercase letters that appear at even positions in the alphabet, where 'a' is at position 0, 'b' is at position 1, 'c' is at position 2, and so on up to 'z' at position 25.\n\nInput format: A single line containing the input string.\n\nOutput format: \n- If splitting occurs (cases 1 or 2), output each word on a separate line.\n- If counting occurs (case 3), output a single integer representing the count.\n\nExamples:\n- \"Hello world!\" should split on whitespace and output the words\n- \"Hello,world!\" should split on commas and output the words  \n- \"abcdef\" should count lowercase letters at even positions (a=0, c=2, e=4) and output 3", "io_examples": [["Hello world!", "Hello\nworld!"], ["Hello,world!", "Hello\nworld!"], ["Hello world,!", "Hello\nworld,!"], ["Hello,Hello,world !", "Hello,Hello,world\n!"], ["abcdef", "3"], ["aaabb", "2"], ["aaaBb", "1"], ["", "0"]]}
{"id": 116, "task": "Given a list of numbers, determine whether or not they are sorted in ascending order. If the list has more than 2 duplicates of the same number (i.e., any number appears 3 or more times), return False. Assume no negative numbers and only integers.\n\nInput format: A JSON array of non-negative integers on a single line.\nOutput format: A single line containing either \"True\" or \"False\".", "io_examples": [["[5]", "True"], ["[1, 2, 3, 4, 5]", "True"], ["[1, 3, 2, 4, 5]", "False"], ["[1, 2, 3, 4, 5, 6]", "True"], ["[1, 2, 3, 4, 5, 6, 7]", "True"], ["[1, 3, 2, 4, 5, 6, 7]", "False"], ["[]", "True"], ["[1]", "True"], ["[3, 2, 1]", "False"], ["[1, 2, 2, 2, 3, 4]", "False"], ["[1, 2, 3, 3, 3, 4]", "False"], ["[1, 2, 2, 3, 3, 4]", "True"], ["[1, 2, 3, 4]", "True"]]}
{"id": 117, "task": "You are given two intervals, where each interval is a pair of integers. For example, interval = (start, end) = (1, 2).\nThe given intervals are closed which means that the interval (start, end) includes both start and end.\nFor each given interval, it is assumed that its start is less than or equal to its end.\nYour task is to determine whether the length of intersection of these two intervals is a prime number.\n\nExample: the intersection of the intervals (1, 3) and (2, 4) is (2, 3) which has length 1, which is not a prime number.\n\nA prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself. Note that 1 and 0 are not prime numbers.\n\nThe length of an interval (a, b) is calculated as b - a.\n\nIf the length of the intersection is a prime number, return \"YES\", otherwise return \"NO\".\nIf the two intervals don't intersect, return \"NO\".\n\nInput format: Four space-separated integers representing start1, end1, start2, end2 where (start1, end1) is the first interval and (start2, end2) is the second interval.\n\nOutput format: A single string \"YES\" or \"NO\".", "io_examples": [["1 2 2 3", "NO"], ["-1 1 0 4", "NO"], ["-3 -1 -5 5", "YES"], ["-2 2 -4 0", "YES"], ["-11 2 -1 -1", "NO"], ["1 2 3 5", "NO"], ["1 2 1 2", "NO"], ["-2 -2 -3 -2", "NO"]]}
{"id": 118, "task": "You are given an array of integers. Calculate the sum of the absolute values (magnitudes) of all integers in the array, then multiply this sum by the product of all signs of each number in the array.\n\nThe sign of a number is defined as:\n- 1 for positive numbers\n- -1 for negative numbers  \n- 0 for zero\n\nThe product of signs follows these rules:\n- If any number in the array is 0, the product of signs is 0\n- Otherwise, the product of signs is 1 if there's an even number of negative numbers, and -1 if there's an odd number of negative numbers\n\nFor an empty array, return None.\n\nInput format: A single line containing space-separated integers. For an empty array, the input will be the string \"empty\" or an empty line.\n\nOutput format: A single integer representing the result, or the string \"None\" for an empty array.\n\nExamples:\n- For array [1, 2, 2, -4]: sum of magnitudes = 1+2+2+4 = 9, there's 1 negative number so sign product = -1, result = 9 * (-1) = -9\n- For array [0, 1]: contains 0, so result = 0\n- For empty array: result = None", "io_examples": [["1 2 2 -4", "-9"], ["0 1", "0"], ["1 1 1 2 3 -1 1", "-10"], ["empty", "None"], ["2 4 1 2 -1 -1 9", "20"], ["-1 1 -1 1", "4"], ["-1 1 1 1", "-4"], ["-1 1 1 0", "0"]]}
{"id": 119, "task": "Given a grid with N rows and N columns (N >= 2) and a positive integer k, each cell of the grid contains a value. Every integer in the range [1, N * N] inclusive appears exactly once on the cells of the grid.\n\nYou have to find the minimum path of length k in the grid. You can start from any cell, and in each step you can move to any of the neighbor cells. In other words, you can go to cells which share an edge with your current cell.\n\nPlease note that a path of length k means visiting exactly k cells (not necessarily distinct). You CANNOT go off the grid.\n\nA path A (of length k) is considered less than a path B (of length k) if after making the ordered lists of the values on the cells that A and B go through (let's call them lst_A and lst_B), lst_A is lexicographically less than lst_B. In other words, there exists an integer index i (1 <= i <= k) such that lst_A[i] < lst_B[i] and for any j (1 <= j < i) we have lst_A[j] = lst_B[j].\n\nIt is guaranteed that the answer is unique.\n\nInput format:\n- First line: An integer N representing the grid size\n- Next N lines: N space-separated integers representing each row of the grid\n- Last line: An integer k representing the path length\n\nOutput format:\n- k lines, each containing one integer representing the values on the cells that the minimum path goes through, in order", "io_examples": [["3\n1 2 3\n4 5 6\n7 8 9\n3", "1\n2\n1"], ["3\n5 9 3\n4 1 6\n7 8 2\n1", "1"], ["4\n1 2 3 4\n5 6 7 8\n9 10 11 12\n13 14 15 16\n4", "1\n2\n1\n2"], ["4\n6 4 13 10\n5 7 12 1\n3 16 11 15\n8 14 9 2\n7", "1\n10\n1\n10\n1\n10\n1"], ["2\n1 2\n3 4\n10", "1\n2\n1\n2\n1\n2\n1\n2\n1\n2"]]}
{"id": 120, "task": "The Tribonacci sequence is defined by the following recurrence relation:\n- tri(1) = 3\n- tri(n) = 1 + n / 2, if n is even\n- tri(n) = tri(n - 1) + tri(n - 2) + tri(n + 1), if n is odd\n\nFor example:\n- tri(2) = 1 + (2 / 2) = 2\n- tri(4) = 3\n- tri(3) = tri(2) + tri(1) + tri(4) = 2 + 3 + 3 = 8\n\nGiven a non-negative integer n, compute the first n + 1 numbers of the Tribonacci sequence.\n\nInput format: A single non-negative integer n\nOutput format: The first n + 1 numbers of the Tribonacci sequence, each on a separate line. Numbers should be displayed as decimal values (with .0 for whole numbers when applicable).", "io_examples": [["3", "1\n3\n2.0\n8.0"], ["0", "1"], ["1", "1\n3"], ["4", "1\n3\n2.0\n8.0\n3.0"], ["5", "1\n3\n2.0\n8.0\n3.0\n15.0"], ["7", "1\n3\n2.0\n8.0\n3.0\n15.0\n4.0\n24.0"]]}
{"id": 121, "task": "Given a positive integer n, calculate the product of all odd digits in the number. If all digits are even, return 0.\n\nInput format: A single positive integer n\nOutput format: A single integer representing the product of all odd digits, or 0 if all digits are even\n\nExamples:\n- For input 1, the output is 1 (the digit 1 is odd)\n- For input 4, the output is 0 (the digit 4 is even)\n- For input 235, the output is 15 (the odd digits are 3 and 5, and 3*5=15)", "io_examples": [["5", "5"], ["54", "5"], ["120", "1"], ["5014", "5"], ["98765", "315"], ["5576543", "2625"], ["2468", "0"]]}
{"id": 122, "task": "You are given a list of numbers. You need to return the sum of squared numbers in the given list. Before squaring, round each element in the list UP to the nearest integer (using the ceiling function).\n\nInput format: A list of numbers (which may be integers or floating-point numbers).\n\nOutput format: A single integer representing the sum of the squared ceiling values.\n\nExamples:\n- For input [1,2,3] the output should be 14\n- For input [1,4,9] the output should be 98\n- For input [1,3,5,7] the output should be 84\n- For input [1.4,4.2,0] the output should be 29\n- For input [-2.4,1,1] the output should be 6\n\nNote: The ceiling function rounds a number UP to the nearest integer. For example, ceiling(1.4) = 2, ceiling(-2.4) = -2, ceiling(3) = 3.", "io_examples": [["[1,2,3]", "14"], ["[1.0,2,3]", "14"], ["[1,3,5,7]", "84"], ["[1.4,4.2,0]", "29"], ["[-2.4,1,1]", "6"], ["[100,1,15,2]", "10230"], ["[10000,10000]", "200000000"], ["[-1.4,4.6,6.3]", "75"], ["[-1.4,17.9,18.9,19.9]", "1086"], ["[0]", "0"], ["[-1]", "1"], ["[-1,1,0]", "2"]]}
{"id": 123, "task": "Create a function that returns true if the last character of a given string is an alphabetical character and is not part of a word, and false otherwise.\n\nNote: A \"word\" is a group of characters separated by space.\n\nThe function should:\n- Return true if the last character is a single alphabetical character (a-z or A-Z) that stands alone (separated by spaces from other characters)\n- Return false if the last character is part of a word (multiple characters without spaces)\n- Return false if the last character is not alphabetical (e.g., space, number, or special character)\n- Return false if the string is empty\n\nInput format: A single line containing a string (may be empty, may contain spaces)\nOutput format: A single line containing either \"true\" or \"false\" (lowercase)", "io_examples": [["apple", "false"], ["apple pi e", "true"], ["eeeee", "false"], ["A", "true"], ["Pumpkin pie ", "false"], ["Pumpkin pie 1", "false"], ["", "false"], ["eeeee e ", "false"], ["apple pie", "false"], ["apple pi e ", "false"]]}
{"id": 124, "task": "Given an array of integers without duplicate values, find the largest index of an element which is strictly less than the element immediately preceding it. If no such element exists, return -1.\n\nInput format: A single line containing an array of integers in the format [a1,a2,a3,...,an] where the integers are separated by commas. An empty array is represented as [].\n\nOutput format: A single integer representing the largest index where an element is less than its predecessor, or -1 if no such element exists.", "io_examples": [["[1,2,4,3,5]", "3"], ["[1,2,4,5]", "-1"], ["[1,4,2,5,6,7,8,9,10]", "2"], ["[4,8,5,7,3]", "4"], ["[]", "-1"]]}
{"id": 125, "task": "Given a list of integers, find two values:\n1. The largest of the negative integers in the list\n2. The smallest of the positive integers in the list\n\nIf there are no negative integers, the first value should be None. If there are no positive integers, the second value should be None. Note that zero is neither positive nor negative.\n\nInput format: A list of integers in the format [a, b, c, ...] or [] for an empty list.\n\nOutput format: Two values separated by a space. Use the text \"None\" (without quotes) for values that don't exist. For example: \"None 1\" or \"-2 1\" or \"None None\".", "io_examples": [["[2, 4, 1, 3, 5, 7]", "None 1"], ["[2, 4, 1, 3, 5, 7, 0]", "None 1"], ["[1, 3, 2, 4, 5, 6, -2]", "-2 1"], ["[4, 5, 3, 6, 2, 7, -7]", "-7 2"], ["[7, 3, 8, 4, 9, 2, 5, -9]", "-9 2"], ["[]", "None None"], ["[0]", "None None"], ["[-1, -3, -5, -6]", "-1 None"], ["[-1, -3, -5, -6, 0]", "-1 None"], ["[-6, -4, -4, -3, 1]", "-3 1"], ["[-6, -4, -4, -3, -100, 1]", "-3 1"]]}
{"id": 126, "task": "Create a program that takes two values and returns the larger one in its original format.\n\nThe two values can be:\n- Integers\n- Floating-point numbers\n- Strings representing real numbers\n\nNote: If a real number is represented as a string, the decimal separator might be either a period (.) or a comma (,).\n\nThe program should:\n- Compare the numerical values of the two inputs\n- Return the larger value in its original format (preserving the type and format it was given in)\n- Return null if the values are numerically equal\n\nInput format: A JSON object with two fields 'a' and 'b' representing the two values to compare.\n\nOutput format: The larger value in its original format (as a JSON value), or the string 'null' if the values are equal.", "io_examples": [["{\"a\": 1, \"b\": 2}", "2"], ["{\"a\": 1, \"b\": 2.5}", "2.5"], ["{\"a\": 2, \"b\": 3}", "3"], ["{\"a\": 5, \"b\": 6}", "6"], ["{\"a\": 1, \"b\": \"2,3\"}", "\"2,3\""], ["{\"a\": \"5,1\", \"b\": \"6\"}", "\"6\""], ["{\"a\": \"1\", \"b\": \"2\"}", "\"2\""], ["{\"a\": \"1\", \"b\": 1}", "null"]]}
{"id": 127, "task": "Determine whether a given number can be written as the sum of exactly 4 positive even numbers.\n\nInput: A single integer n.\n\nOutput: Output \"True\" if the number can be expressed as the sum of exactly 4 positive even numbers, otherwise output \"False\".\n\nNote: Positive even numbers are 2, 4, 6, 8, 10, etc. The sum must use exactly 4 such numbers (they don't need to be distinct).", "io_examples": [["4", "False"], ["6", "False"], ["8", "True"], ["10", "True"], ["11", "False"], ["12", "True"], ["13", "False"], ["16", "True"]]}
{"id": 128, "task": "The special factorial (also known as Brazilian factorial) is defined as:\nspecial_factorial(n) = n! * (n-1)! * (n-2)! * ... * 1!\nwhere n > 0\n\nIn other words, it is the product of all factorials from 1! up to n!.\n\nFor example:\n- special_factorial(4) = 4! * 3! * 2! * 1! = 24 * 6 * 2 * 1 = 288\n\nYour task is to compute the special factorial of a given positive integer.\n\nInput: A single positive integer n (n > 0)\nOutput: A single integer representing the special factorial of n", "io_examples": [["4", "288"], ["5", "34560"], ["7", "125411328000"], ["1", "1"]]}
{"id": 129, "task": "Given a string of text, transform all spaces according to the following rules:\n- Replace each single space with an underscore character (_)\n- Replace each occurrence of exactly 2 consecutive spaces with two underscore characters (__)\n- Replace each occurrence of 3 or more consecutive spaces with a single dash character (-)\n\nInput format: A single line containing a string of text (may contain letters, numbers, and spaces)\nOutput format: A single line containing the transformed string", "io_examples": [["Example", "Example"], ["Mudasir Hanif ", "Mudasir_Hanif_"], ["Yellow Yellow  Dirty  Fellow", "Yellow_Yellow__Dirty__Fellow"], ["Exa   mple", "Exa-mple"], ["   Exa 1 2 2 mple", "-Exa_1_2_2_mple"]]}
{"id": 130, "task": "Create a program that validates a file name according to specific rules. The program should read a string representing a file's name from standard input and output 'Yes' if the file's name is valid, and 'No' otherwise.\n\nA file's name is considered to be valid if and only if all the following conditions are met:\n- There should not be more than three digits ('0'-'9') in the file's name.\n- The file's name contains exactly one dot '.'\n- The substring before the dot should not be empty, and it must start with a letter from the latin alphabet ('a'-'z' and 'A'-'Z').\n- The substring after the dot should be one of these: 'txt', 'exe', 'dll'\n\nInput format: A single line containing a string representing the file name.\nOutput format: A single line containing either 'Yes' or 'No'.", "io_examples": [["example.txt", "Yes"], ["1example.dll", "No"], ["s1sdf3.asd", "No"], ["K.dll", "Yes"], ["MY16FILE3.exe", "Yes"], ["His12FILE94.exe", "No"], ["_Y.txt", "No"], ["?aREYA.exe", "No"], ["/this_is_valid.dll", "No"], ["this_is_valid.wow", "No"], ["this_is_valid.txt", "Yes"], ["this_is_valid.txtexe", "No"], ["#this2_i4s_5valid.ten", "No"], ["@this1_is6_valid.exe", "No"], ["this_is_12valid.6exe4.txt", "No"], ["all.exe.txt", "No"], ["I563_No.exe", "Yes"], ["Is3youfault.txt", "Yes"], ["no_one#knows.dll", "Yes"], ["1I563_Yes3.exe", "No"], ["I563_Yes3.txtt", "No"], ["final..txt", "No"], ["final132", "No"], ["_f4indsartal132.", "No"], [".txt", "No"], ["s.", "No"]]}
{"id": 131, "task": "Given a sequence of integers, process each integer based on its position (using 0-based indexing):\n- If the position is a multiple of 3, square the integer\n- If the position is a multiple of 4 and NOT a multiple of 3, cube the integer\n- Otherwise, keep the integer unchanged\n\nAfter processing all integers, return the sum of all the processed values.\n\nInput format: A single line containing space-separated integers. An empty line or no input represents an empty sequence.\n\nOutput format: A single integer representing the sum of all processed values.\n\nExamples:\n- For the sequence [1, 2, 3]: position 0 is a multiple of 3, so square 1 to get 1; position 1 is neither, so keep 2; position 2 is neither, so keep 3. Sum = 1 + 2 + 3 = 6\n- For an empty sequence: the sum is 0\n- For the sequence [-1, -5, 2, -1, -5]: position 0 squares to 1, position 1 stays -5, position 2 stays 2, position 3 squares to 1, position 4 cubes to -125. Sum = 1 + (-5) + 2 + 1 + (-125) = -126", "io_examples": [["1 2 3", "6"], ["1 4 9", "14"], ["", "0"], ["1 1 1 1 1 1 1 1 1", "9"], ["-1 -1 -1 -1 -1 -1 -1 -1 -1", "-3"], ["0", "0"], ["-1 -5 2 -1 -5", "-126"], ["-56 -99 1 0 -2", "3030"]]}
{"id": 132, "task": "Given a sentence containing words separated by spaces, return a new sentence containing only the words whose lengths are prime numbers. A prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself (e.g., 2, 3, 5, 7, 11, etc.). The order of words in the output should be the same as in the input. If no words have prime lengths, return an empty string.\n\nInput format: A single line containing a sentence with words separated by spaces.\nOutput format: A single line containing the filtered words separated by spaces, or an empty line if no words qualify.\n\nConstraints:\n- The sentence length is between 1 and 100 characters\n- The sentence contains only letters and spaces", "io_examples": [["This is a test", "is"], ["lets go for swimming", "go for"], ["there is no place available here", "there is no place"], ["Hi I am Hussein", "Hi am Hussein"], ["go for it", "go for it"], ["here", ""], ["here is", "is"]]}
{"id": 133, "task": "Implement a program that determines whether the product of two fractions evaluates to a whole number.\n\nThe program should read two fractions from standard input, where each fraction is provided on a separate line in the format: numerator/denominator\n\nBoth the numerator and denominator are positive whole numbers, and the denominator is never zero.\n\nThe program should output \"True\" if the product of the two fractions is a whole number, and \"False\" otherwise.\n\nExamples:\n- The product of 1/5 and 5/1 equals 1, which is a whole number, so the output is True\n- The product of 1/6 and 2/1 equals 1/3, which is not a whole number, so the output is False\n- The product of 7/10 and 10/2 equals 7/2, which is not a whole number, so the output is False", "io_examples": [["1/5\n5/1", "True"], ["1/6\n2/1", "False"], ["5/1\n3/1", "True"], ["7/10\n10/2", "False"], ["2/10\n50/10", "True"], ["7/2\n4/2", "True"], ["11/6\n6/1", "True"], ["2/3\n5/2", "False"], ["5/2\n3/5", "False"], ["2/4\n8/4", "True"], ["2/4\n4/2", "True"], ["1/5\n1/5", "False"]]}
{"id": 134, "task": "Sort a list of integers in ascending order according to the sum of their digits.\n\nFor calculating the digit sum:\n- For positive numbers, sum all digits normally\n- For negative numbers, only the first (leftmost) digit is negative, and the rest are positive. For example, -12 has digit sum: -1 + 2 = 1\n- For zero, the digit sum is 0\n\nIf multiple numbers have the same digit sum, maintain their original order from the input list (stable sort).\n\nInput format: A list of integers in the format [num1,num2,...] or [] for an empty list\nOutput format: Each sorted integer on a new line. For an empty list, produce no output.", "io_examples": [["[1, 11, -1, -11, -12]", "-1\n-11\n1\n-12\n11"], ["[]", ""], ["[1234,423,463,145,2,423,423,53,6,37,3457,3,56,0,46]", "0\n2\n3\n6\n53\n423\n423\n423\n1234\n145\n37\n46\n56\n463\n3457"], ["[1, -11, -32, 43, 54, -98, 2, -3]", "-3\n-32\n-98\n-11\n1\n2\n43\n54"], ["[0,6,6,-76,-21,23,4]", "-76\n-21\n0\n4\n23\n6\n6"]]}
{"id": 135, "task": "Write a program that takes an array of numbers as input and returns the number of elements in the array that are greater than 10 and both first and last digits of a number are odd (1, 3, 5, 7, 9).\n\nInput format: A single line containing space-separated integers. An empty line represents an empty array.\n\nOutput format: A single integer representing the count of numbers that meet the criteria.\n\nExamples:\n- For input [15, -73, 14, -15], the output is 1 (only 15 qualifies: it's > 10, first digit is 1 (odd), last digit is 5 (odd))\n- For input [33, -2, -3, 45, 21, 109], the output is 2 (33 and 21 qualify)", "io_examples": [["5 -2 1 -5", "0"], ["15 -73 14 -15", "1"], ["33 -2 -3 45 21 109", "2"], ["43 -12 93 125 121 109", "4"], ["71 -2 -33 75 21 19", "3"], ["1", "0"], ["", "0"]]}
{"id": 136, "task": "You are given a positive integer n. You have to create an integer array a of length n.\nFor each i (1 ≤ i ≤ n), the value of a[i] = i * i - i + 1.\nReturn the number of triples (a[i], a[j], a[k]) of a where i < j < k, and a[i] + a[j] + a[k] is a multiple of 3.\n\nInput: A single positive integer n.\nOutput: A single integer representing the count of valid triples.\n\nExample:\nInput: n = 5\nOutput: 1\nExplanation: \na = [1, 3, 7, 13, 21]\nThe only valid triple is (1, 7, 13).", "io_examples": [["5", "1"], ["6", "4"], ["10", "36"], ["100", "53361"]]}
{"id": 137, "task": "There are eight planets in our solar system ordered by their proximity to the Sun: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune.\n\nWrite a program that takes two planet names as input. The program should output all planets whose orbits are located between the orbits of the two input planets, sorted by their proximity to the sun.\n\nInput format: Two lines, each containing a planet name (case-sensitive).\n\nOutput format: Each planet name on a separate line, ordered by proximity to the sun. If the input contains invalid planet names, or if both planet names are the same, or if the planets are adjacent with no planets between them, output nothing (no lines).\n\nExamples:\n- Input: \"Jupiter\" and \"Neptune\" → Output: \"Saturn\" and \"Uranus\" (each on a new line)\n- Input: \"Earth\" and \"Mercury\" → Output: \"Venus\"\n- Input: \"Mercury\" and \"Uranus\" → Output: \"Venus\", \"Earth\", \"Mars\", \"Jupiter\", \"Saturn\" (each on a new line)", "io_examples": [["Jupiter\nNeptune", "Saturn\nUranus"], ["Earth\nMercury", "Venus"], ["Mercury\nUranus", "Venus\nEarth\nMars\nJupiter\nSaturn"], ["Neptune\nVenus", "Earth\nMars\nJupiter\nSaturn\nUranus"], ["Earth\nEarth", ""], ["Mars\nEarth", ""], ["Jupiter\nMakemake", ""]]}
{"id": 138, "task": "Write a program that accepts a list of strings as input, filters out the strings that have odd lengths, and returns the remaining strings in sorted order.\n\nThe input will always be a list of strings and may contain duplicates. The output should be sorted in ascending order by the length of each string. If two strings have the same length, they should be sorted alphabetically.\n\nInput format: A single line containing space-separated strings.\n\nOutput format: Each resulting string on a new line. If no strings remain after filtering (all had odd lengths), output nothing (empty output).", "io_examples": [["aa a aaa", "aa"], ["school AI asdf b", "AI\nasdf\nschool"], ["d b c a", ""], ["d dcba abcd a", "abcd\ndcba"], ["AI ai au", "AI\nai\nau"], ["a b b c c a", ""], ["aaaa bbbb dd cc", "cc\ndd\naaaa\nbbbb"]]}
{"id": 139, "task": "Write a program that takes three integers as input: n, x, and y.\n\nThe program should determine whether n is a prime number. A prime number is a natural number greater than 1 that has no positive divisors other than 1 and itself. The number 1 is not considered prime.\n\nIf n is a prime number, the program should output the value of x.\nIf n is not a prime number, the program should output the value of y.\n\nInput format: Three space-separated integers on a single line: n, x, and y.\nOutput format: A single integer representing either x or y based on whether n is prime.", "io_examples": [["7 34 12", "34"], ["15 8 5", "5"], ["1 2 0", "0"], ["2 2 0", "2"], ["3 33 5212", "33"], ["6 34 1234", "1234"]]}
{"id": 140, "task": "Your task is to determine if a person correctly guessed the results of a number of matches.\nYou are given two sequences of scores and guesses of equal length, where each index shows a match. \nReturn a sequence of the same length denoting how far off each guess was. If they have guessed correctly, the value is 0, and if not, the value is the absolute difference between the guess and the score.\n\nInput format: Two lines, each containing space-separated integers. The first line contains the actual game scores, and the second line contains the guesses.\n\nOutput format: One integer per line, representing the absolute difference between each corresponding pair of game score and guess.", "io_examples": [["1 2 3 4 5 1\n1 2 3 4 2 -2", "0\n0\n0\n0\n3\n3"], ["0 0 0 0 0 0\n0 0 0 0 0 0", "0\n0\n0\n0\n0\n0"], ["1 2 3\n-1 -2 -3", "2\n4\n6"], ["1 2 3 5\n-1 2 3 4", "2\n0\n0\n1"]]}
{"id": 141, "task": "Given two words, determine whether the second word or any of its rotations is a substring of the first word.\n\nA rotation of a word is obtained by moving characters from the beginning to the end. For example, the rotations of \"abc\" are \"abc\", \"bca\", and \"cab\".\n\nInput format: Two lines, each containing a word (string of characters).\n- First line: the first word\n- Second line: the second word\n\nOutput format: A single line containing either \"True\" or \"False\".\n- \"True\" if the second word or any of its rotations is a substring of the first word\n- \"False\" otherwise", "io_examples": [["xyzw\nxyw", "False"], ["yello\nell", "True"], ["whattup\nptut", "False"], ["efef\nfee", "True"], ["abab\naabb", "False"], ["winemtt\ntinem", "True"]]}
{"id": 142, "task": "Given an integer (which may be positive, negative, or zero), count how many of its digits are even (0, 2, 4, 6, 8) and how many are odd (1, 3, 5, 7, 9). The sign of the number should be ignored when counting digits.\n\nInput format: A single integer on one line.\n\nOutput format: Two integers on separate lines. The first line contains the count of even digits, and the second line contains the count of odd digits.", "io_examples": [["7", "0\n1"], ["-78", "1\n1"], ["3452", "2\n2"], ["346211", "3\n3"], ["-345821", "3\n3"], ["-2", "1\n0"], ["-45347", "2\n3"], ["0", "1\n0"]]}
{"id": 143, "task": "Given a positive integer, convert it to its Roman numeral equivalent in lowercase letters.\n\nThe input will be a single positive integer between 1 and 1000 (inclusive).\n\nThe output should be a string representing the Roman numeral equivalent in lowercase.\n\nRoman numeral rules:\n- I = 1, V = 5, X = 10, L = 50, C = 100, D = 500, M = 1000\n- Subtractive notation is used: IV = 4, IX = 9, XL = 40, XC = 90, CD = 400, CM = 900", "io_examples": [["19", "xix"], ["152", "clii"], ["251", "ccli"], ["426", "cdxxvi"], ["500", "d"], ["1", "i"], ["4", "iv"], ["43", "xliii"], ["90", "xc"], ["94", "xciv"], ["532", "dxxxii"], ["900", "cm"], ["994", "cmxciv"], ["1000", "m"]]}
{"id": 144, "task": "Given the lengths of the three sides of a triangle, determine if the three sides form a right-angled triangle. A right-angled triangle is a triangle in which one angle is a right angle (90 degrees).\n\nInput: Three positive integers representing the lengths of the three sides of a triangle, provided as space-separated values on a single line.\n\nOutput: \"True\" if the three sides form a right-angled triangle, \"False\" otherwise.", "io_examples": [["3 4 5", "True"], ["1 2 3", "False"], ["10 6 8", "True"], ["2 2 2", "False"], ["7 24 25", "True"], ["10 5 7", "False"], ["5 12 13", "True"], ["15 8 17", "True"], ["48 55 73", "True"], ["1 1 1", "False"], ["2 2 10", "False"]]}
{"id": 145, "task": "Write a program that accepts a list of strings as input. The list contains different words. Return the word with the maximum number of unique characters. If multiple strings have the maximum number of unique characters, return the one which comes first in lexicographical (alphabetical) order.\n\nInput format: \n- First line contains an integer n, the number of words\n- Following n lines each contain one word (string)\n\nOutput format:\n- A single line containing the word with maximum unique characters (or lexicographically first if there's a tie)", "io_examples": [["3\nname\nof\nstring", "string"], ["3\nname\nenam\ngame", "enam"], ["3\naaaaaaa\nbb\ncc", "aaaaaaa"], ["2\nabc\ncba", "abc"], ["5\nplay\nthis\ngame\nof\nfootbott", "footbott"], ["4\nwe\nare\ngonna\nrock", "gonna"], ["5\nwe\nare\na\nmad\nnation", "nation"], ["4\nthis\nis\na\nprrk", "this"], ["1\nb", "b"], ["3\nplay\nplay\nplay", "play"]]}
{"id": 146, "task": "You're a hungry rabbit, and you already have eaten a certain number of carrots, but now you need to eat more carrots to complete the day's meals.\n\nYou should return two values:\n1. The total number of eaten carrots after your meals\n2. The number of carrots left after your meals\n\nIf there are not enough remaining carrots, you will eat all remaining carrots, but will still be hungry.\n\nInput format:\nThree integers on a line separated by spaces:\n- number: the number of carrots that you have already eaten\n- need: the number of carrots that you need to eat\n- remaining: the number of remaining carrots that exist in stock\n\nOutput format:\nTwo integers separated by a space:\n- The total number of eaten carrots after your meals\n- The number of carrots left after your meals\n\nConstraints:\n* 0 <= number <= 1000\n* 0 <= need <= 1000\n* 0 <= remaining <= 1000", "io_examples": [["5 6 10", "11 4"], ["4 8 9", "12 1"], ["1 10 10", "11 0"], ["2 11 5", "7 0"], ["4 5 7", "9 2"], ["4 5 1", "5 0"]]}
{"id": 147, "task": "Given two lists - one containing operators and one containing operands - build an algebraic expression and return its evaluation.\n\nThe first list contains basic algebra operations:\n- Addition (+)\n- Subtraction (-)\n- Multiplication (*)\n- Floor division (//)\n- Exponentiation (**)\n\nThe second list contains non-negative integers.\n\nThe expression is built by interleaving the operands with the operators in order. The expression is then evaluated following standard mathematical operator precedence rules (exponentiation has highest precedence, followed by multiplication and floor division, then addition and subtraction).\n\nExample:\noperators: ['+', '*', '-']\noperands: [2, 3, 4, 5]\nThis builds the expression: 2 + 3 * 4 - 5\nFollowing operator precedence: 2 + 12 - 5 = 9\n\nConstraints:\n- The length of the operator list equals the length of the operand list minus one\n- The operand list contains only non-negative integers\n- The operator list has at least one operator\n- The operand list has at least two operands\n\nInput format:\n- First line: space-separated operators\n- Second line: space-separated operands (non-negative integers)\n\nOutput format:\n- A single integer representing the result of evaluating the expression", "io_examples": [["** * +\n2 3 4 5", "37"], ["+ * -\n2 3 4 5", "9"], ["// *\n7 3 4", "8"]]}
{"id": 148, "task": "You are given a string s.\n\nFor each character in the string:\n- If the character is a letter, reverse its case (convert lowercase to uppercase or uppercase to lowercase)\n- If the character is not a letter, keep it as it is\n\nSpecial rule: If the string contains no letters at all, reverse the entire string instead.\n\nReturn the resulting string.\n\nInput format: A single line containing a string s\nOutput format: A single line containing the transformed string\n\nExamples:\n- Input \"1234\" produces output \"4321\" (no letters, so reverse the string)\n- Input \"ab\" produces output \"AB\" (has letters, so swap case)\n- Input \"#a@C\" produces output \"#A@c\" (has letters, so swap case while keeping non-letters in place)", "io_examples": [["AsDf", "aSdF"], ["1234", "4321"], ["ab", "AB"], ["#a@C", "#A@c"], ["#AsdfW^45", "#aSDFw^45"], ["#6@2", "2@6#"], ["#$a^D", "#$A^d"], ["#ccc", "#CCC"]]}
{"id": 149, "task": "Given a string as input, compute and return its MD5 hash as a hexadecimal string.\n\nInput format: A single line containing the text to hash. The text may contain any ASCII characters including spaces.\n\nOutput format: A single line containing either:\n- The MD5 hash of the input text as a 32-character hexadecimal string (lowercase), or\n- The word \"None\" (without quotes) if the input is an empty string\n\nSpecial case: If the input string is empty, output \"None\" instead of computing the hash.", "io_examples": [["Hello world", "3e25960a79dbc69b674cd4ec67a72c62"], ["", "None"], ["A B C", "0ef78513b0cb8cef12743f5aeb35f888"], ["password", "5f4dcc3b5aa765d61d8327deb882cf99"]]}
{"id": 150, "task": "Given two positive integers a and b, return the even single-digit numbers between a and b, in ascending order.\n\nThe even single digits are: 2, 4, 6, 8.\n\nThe function should find all even single-digit numbers that fall within the range defined by a and b (inclusive). The order of a and b does not matter - the result should always be in ascending order.\n\nInput format: Two space-separated positive integers a and b.\nOutput format: Each even single digit in the range should be printed on a separate line. If there are no even single digits in the range, output nothing (empty output).", "io_examples": [["2 10", "2\n4\n6\n8"], ["10 2", "2\n4\n6\n8"], ["132 2", "2\n4\n6\n8"], ["17 89", ""]]}
